{"id":19,"date":"2020-04-21T04:57:58","date_gmt":"2020-04-20T18:57:58","guid":{"rendered":"https:\/\/lullyandrose.com.au\/?page_id=19"},"modified":"2023-08-16T18:40:47","modified_gmt":"2023-08-16T08:40:47","slug":"terms-conditions-gold-coast-florist","status":"publish","type":"page","link":"https:\/\/lullyandrose.com.au\/terms-conditions-gold-coast-florist\/","title":{"rendered":"Terms &#038; Conditions"},"content":{"rendered":"<div class=\"row\"  id=\"row-966650863\">\n\n\t<div id=\"col-2141991213\" class=\"col small-12 large-12\"  >\n\t\t\t\t<div class=\"col-inner\"  >\n\t\t\t\n\t\t\t\n\t<div id=\"text-1983728362\" class=\"text\">\n\t\t\n<h3>PLEASE READ THESE TERMS AND CONDITIONS OF USE CAREFULLY BEFORE USING THIS WEBSITE OR MAKING A PURCHASE.<\/h3>\n<p>These terms &amp; conditions apply to every booking or purchase you make from Lully &amp; Rose Floral Studio (also referred to in these terms as we, us or our) and your use of our website. By using our website, purchasing an item, booking an event, consultation or requesting a quote, you warrant that you have read, understand and agree to these terms (including the General Terms below and any other terms &amp; conditions relevant to the service we are providing to you) and you acknowledge that these terms will then apply.<\/p>\n\t\t\n<style>\n#text-1983728362 {\n  font-size: 0.9rem;\n}\n<\/style>\n\t<\/div>\n\t\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\n\t\n<\/div>\n<div class=\"accordion\">\n\t<div id=\"accordion-797568803\" class=\"accordion-item\">\n\t\t<a id=\"accordion-797568803-label\" class=\"accordion-title plain\" href=\"#accordion-item-1.-general-terms\" aria-expanded=\"false\" aria-controls=\"accordion-797568803-content\" >\n\t\t\t<button class=\"toggle\" aria-label=\"Toggle\"><i class=\"icon-angle-down\"><\/i><\/button>\n\t\t\t<span>1. GENERAL TERMS<\/span>\n\t\t<\/a>\n\t\t<div id=\"accordion-797568803-content\" class=\"accordion-inner\" aria-labelledby=\"accordion-797568803-label\" >\n\t\t\t\n<span class=\"scroll-to\" data-label=\"Scroll to: #general-terms\" data-bullet=\"false\" data-link=\"#general-terms\" data-title=\"1. General Terms\" ><a name=\"general-terms\"><\/a><\/span>\n<div class=\"container section-title-container\" style=\"margin-bottom:0px;\"><h2 class=\"section-title section-title-bold\"><b><\/b><span class=\"section-title-main\" >1. GENERAL TERMS<\/span><b><\/b><\/h2><\/div>\n\t<div id=\"text-2545425466\" class=\"text\">\n\t\t\n<h3>OPERATING HOURS<\/h3>\n<p>Lully &amp; Rose Floral Studio is open 8:00am to 3:00pm (QLD time), Tuesday to Friday, and by appointment only Saturday. (We are closed on Public Holidays.)<\/p>\n<p>Lully &amp; Rose Floral Studio deliver Tuesday to Friday, with the exception of public holidays. Orders may be placed on-line for same day delivery prior to 11am AEST\/ 12NOON Daylight Saving Time.<\/p>\n<h3>CHANGES TO YOUR ORDER THAT WE MAY MAKE<\/h3>\n<p><a href=\"https:\/\/lullyandrose.com.au\">Lully &amp; Rose Floral Studio<\/a> reserves the right to make the appropriate substitutions to the order and\/or packaging with an item of equal or greater value to ensure that your flowers are of the highest standard. Should Lully &amp; Rose Floral Studio feel that the order cannot be fulfilled due to a lack of stock availability we will contact you as soon as possible to arrange an alternative.<\/p>\n<p>Lully &amp; Rose Floral Studio ensures the freshest and highest quality flowers, hand selected and bought daily. Care instructions are included with every floral order to help increase the life span of your flowers. However, products sold on this website are a perishable, natural item and flowers life span is dependent on species, resulting in some flower varieties living longer than others. Flowers are a product of nature; availability is dependent on season and markets. As a result, not all goods produced are as pictured on www.lullyandrose.com.au, by accepting these terms you are acknowledging there may be discrepancies between images and produced goods.<\/p>\n<h3><em>Variations to botanical\/perishable materials\/flower selection<\/em><\/h3>\n<p>No varieties of any fresh cut botanical materials can ever be guaranteed. This is due to natural growing, supply chain rejections, quarantine restrictions, demand and seasonal availability. Lully &amp; Rose Floral Studio do not guarantee nor specify any specific flower varieties or flower colours. Lully &amp; Rose Floral Studio will only use the best seasonal flowers available at the time of the event and suitable substitutes that we see professionally fit may be used in selecting flower varieties and flower colours suitable for your floral arrangement\/s.<\/p>\n<p>Lully &amp; Rose Floral Studio accepts no liability on behalf of growers, <a href=\"https:\/\/www.petalpeddlers.com.au\">wholesalers<\/a>, agents (and similar) for not supplying the correct product and\/or service. A decision may be made on our behalf by any of the aforementioned to complete the supply for the order as they see professionally fit.<\/p>\n<h3><em>Sizing Variations<\/em><\/h3>\n<p>Where measurements have been provided for floral arrangements, this sizing is a guide only. Floral arrangements are created using flowers that vary in size and shape throughout their natural season.  This can affect the sizing of the products we provide, making floral arrangements slightly smaller or larger. Lully &amp; Rose Floral Studio (the business) accepts no responsibility for variations in size.<\/p>\n<h3>WHEN YOU MAY MAKE A CHANGE TO YOUR ORDER<\/h3>\n<p>You acknowledge and agree that our products are made to order and so we cannot generally accommodate requests for changes or cancellations. We reserve all rights to refuse any requests for variations to your order, however, we may in our discretion agree to cancel or vary an order provided you have sent a request to us in writing within 24 hours of ordering.<\/p>\n<p>For changes to weddings or events, see the timeframes specified below.<\/p>\n<h3>DELIVERY<\/h3>\n<p>For same day delivery, your order must be placed before 11am AEST\/ 12NOON Daylight Saving Time.<\/p>\n<p>It is your responsibility to provide a full and correct delivery address, along with the recipient’s daytime correct contact number. You must ensure the address for delivery is appropriate, particularly when you are authorising us to leave your order if nobody is home, and you must ensure our delivery partner can access that location (e.g. apartments and units within a secured complex). Alternatively, Lully &amp; Rose Floral Studio reserves the right to contact the recipient prior to delivery to arrange an appropriate delivery time\/location.<\/p>\n<p>While we make all attempts to get your order to the recipient safely, Lully &amp; Rose Floral Studio is not liable for orders that are stolen, damaged, or lost due to being left unattended at your requested delivery address in circumstances where you have given us an authority to leave.<\/p>\n<p>If the recipient is not at home to accept your order, our couriers will leave the order at your requested location (if authority has been given) at the allocated delivery address. Our couriers will call and\/or send a text message advising the recipient that a delivery has been made. We (and our couriers) reserve all rights to determine whether the nominated delivery address is safe and appropriate to leave your order unattended. If authority has been provided to leave the item if the recipient is not home, yet it is deemed unsafe to leave the order at the door, we may arrange for the item to be returned to our studio. If returned to our studio, we will contact you to arrange a redelivery (redelivery fees will apply) or to arrange collection.<\/p>\n<p>If you do not provide authority to leave the goods unattended, you may collect them from Lully &amp; Rose Floral Studio, or they may be redelivered to you. The redelivery of goods will incur an additional delivery fee.<\/p>\n<p>You acknowledge that flowers are perishable and that their life span may decrease if they are required to be returned to us and\/or redelivered to you, and you agree we are not obliged to resupply fresh flowers in these circumstances.<\/p>\n<p>We respectfully ask to please enquire with the recipient (if possible) to ensure they have received their gift prior to lodging a non-delivery query. We deliver up to 5.30pm on weekdays.<\/p>\n<p>If we do not deliver your order and we are at fault, we will deliver you a new order (with free delivery) or provide you with a gift certificate or refund (including delivery costs).<\/p>\n<p>Lully &amp; Rose Floral Studio uses multiple reputable courier companies to deliver physical goods. Deliveries are processed promptly upon receipt of full payment. Delivery times may vary depending on the delivery company chosen. Special delivery conditions apply to hospitals, nursing homes, hotels, restaurants, funeral parlours, crematoriums and cemeteries and may be handled by a third party.<\/p>\n<h3><em>Delivery to Hospitals <\/em><\/h3>\n<p>If you are sending an order to a hospital, please confirm the patient has not been discharged; Lully &amp; Rose Floral Studio is not liable for any unsuccessful deliveries made to hospitals due to incorrect information provided or if the recipient has been discharged. Re-delivery fees will apply.<\/p>\n<h3><i>Valentine&#8217;s Day \/ Mother&#8217;s Day<\/i><\/h3>\n<p>Orders must be placed seven (7) business days prior to Valentine’s Day\/Mother’s Day for guaranteed delivery on Valentine’s Day\/Mother’s Day. No timed deliveries are accepted for Valentine’s Day\/Mother’s Day.<\/p>\n<p>All orders to business addresses will be delivered by 5:30pm. All orders to home addresses will be delivered by 7:00pm.<\/p>\n<h3><i>Interstate and International orders <\/i><\/h3>\n<p>If you would like Lully &amp; Rose Floral Studio to organise a delivery of flowers Interstate or Internationally we can assist with recommendations.<\/p>\n<h3>CARING FOR YOUR ORDER<\/h3>\n<p>The most crucial period for flowers is in the first 24 hours; affecting the longevity of your flowers as they absorb half the water they require to survive during this time. This is why we send all our florals out in water. Once we dispatch our flowers, a number of changes in conditions may result in their longevity being reduced. Environmental factors such as air conditioning, extreme heat or changes in climate may have an adverse effect on the flowers.<\/p>\n<h3>ALCOHOL<\/h3>\n<p>It is against the law to sell or supply alcohol to, or to obtain alcohol on behalf of, a person under the age of 18 years. If you have ordered alcohol, an adult must receive and sign for the delivery. If we believe the receiver to be under 18 years of age they may be asked to show I.D. We reserve all rights to refuse to leave the package at your delivery address if an adult recipient (or another responsible adult on behalf of a recipient who is a minor) proves to not be home.<\/p>\n<h3>RETURNS AND REFUNDS<\/h3>\n<p>If you are seeking a return or refund, please notify Lully &amp; Rose Floral Studio within 24 hours of the time you received your purchase (i.e. if purchased in store, then the time of your purchase, or if delivered to you, then the time of delivery).<\/p>\n<p>Lully &amp; Rose Floral Studio will not accept returns based on change of mind or design. All other returns and refunds are handled in accordance with the <a href=\"https:\/\/consumer.gov.au\/australian-consumer-law\">Australian Consumer Law<\/a>.<\/p>\n<p>In cases of flowers perishing within 24 hours of purchase and\/or delivery and all care instructions have been followed, or if Lully &amp; Rose Floral Studio produced the incorrect goods, or you are otherwise entitled to a refund or replacement under the Australian Consumer Law, Lully &amp; Rose Floral Studio will (at our election) provide a replacement or gift certificate.<\/p>\n<p>Lully &amp; Rose Floral Studio reserves the right to request images of original goods or other proof of purchase, for our records before processing your request. If the original goods have been disposed of, or if images have not been produced, this may affect our ability to process your request.<\/p>\n<p>Lully &amp; Rose Floral Studio should be notified immediately of any goods that are damaged or lost in transit. Replacement of damaged or lost items is made at the discretion of Lully &amp; Rose Floral Studio.<\/p>\n<p>To contact us about a return or refund, please email Lully &amp; Rose Floral Studio at i<a href=\"mailto:nfo@lullyandrose.com.au\">nfo@lullyandrose.com.au<\/a> and your email will be responded to between our business hours (10.00am to 2.00pm).<\/p>\n<h3>LIMITATION OF LIABILITY<\/h3>\n<p><i>Liability relating to our products and services <\/i><br \/>\nYou may have certain rights and remedies under the Australian Consumer Law (including, without limitation, consumer guarantee rights) that cannot be excluded, restricted or modified by these Terms. For example, our products come with non-excludable guarantees that they are of acceptable quality and fit for their usual purpose. Nothing in these terms operates to exclude, restrict or modify the application of any implied condition or warranty, provision, the exercise of any right or remedy, or the imposition of any liability, implied or conferred under the Australian Consumer Law or any other statute, the exclusion, restriction or modification of which would contravene that statute or cause any of these terms to be void (the <b>Non-excludable Liabilities<\/b>).<\/p>\n<p>All conditions, warranties, guarantees, rights, remedies, liabilities or other terms implied or conferred by statute, custom, or the general law that impose any liability or obligation on us are expressly excluded under these terms. This does not apply to the Non-excludable Liabilities.<\/p>\n<p>Except in relation to Non-excludable Liabilities, our liability to you arising out of these terms and whether arising under any indemnity, statute, in tort (for negligence or otherwise), or on any other basis is limited as follows:<\/p>\n<ol>\n<li>we have no liability whatsoever to you for any loss, harm, damage, cost or expense (including legal costs on a full indemnity basis) in the nature of special, indirect or consequential loss or damage;<\/li>\n<li>for any liability relating to a product not conforming to specifications or for any claim that the product is defective or deficient, our liability to you is limited to replacing the product, or repairing the product (at the election of us), and the cost of re-delivery to you; and<\/li>\n<li>for all other liability relating to any other loss or damage suffered or incurred by you in any way relating to these terms, our liability is excluded to the maximum extent permitted by law.<\/li>\n<\/ol>\n<p>In relation to our liability to you for a failure to comply with any Non-excludable Liability, we acknowledge and agree that:<\/p>\n<p><i>Our products and services come with guarantees that cannot be excluded under the Australian Consumer Law. You are entitled to a replacement or refund for a major failure and compensation for any other reasonably foreseeable loss or damage. You are also entitled to have the product repaired or replaced if it fails to be of acceptable quality and the failure does not amount to a major failure.<\/i><\/p>\n<h3><i>Liability relating to our website<\/i><\/h3>\n<p>Lully &amp; Rose Floral Studio gives no warranty that our website or server is free of errors, viruses or any other harmful components. Whilst we, at all times endeavour to have the most accurate, reliable and up-to-date information on our website, we do not warrant or make any representations regarding the information on our website or its correctness, suitability, accuracy, reliability, or otherwise. You agree and accept that Lully &amp; Rose Floral Studio is not responsible for any loss or damage you might suffer related to your use of our website, whether from errors or from omissions in our documents or information or from any other use of the website.<\/p>\n<h3>AGE OF CONSENT<\/h3>\n<p>By using this site, you represent that you are at least 18 years of age, or that you are at least 18 years of age and that you have given us your consent to allow any of your minor dependents to use this site. You must be over 18 years of age to use this website to purchase any alcohol products.<\/p>\n<h3>EXCLUSION OF COMPETITORS<\/h3>\n<p>If you are in the business of creating similar documents, goods or services for the purpose of providing them for a fee to users, whether they be business users or domestic users, then you are a competitor of Lully &amp; Rose Floral Studio. Lully &amp; Rose Floral Studio expressly excludes and does not permit competitors to use or access its website, www.lullyandrose.com.au, to download any documents or information from its website or obtain any such documents or information through a third party. If you breach this term then Lully &amp; Rose Floral Studio will hold you fully responsible for any loss that it might sustain and further holds you accountable for all profits that you might make from improper use. Lully &amp; Rose Floral Studio reserves the right to exclude and not permit any person from using its website or any of the documents and information contained on it.<\/p>\n<h3>NATURAL DISASTER &amp; OTHER UNFORSEEN EVENTS<\/h3>\n<p>In the unlikely event that performance of our obligations is delayed or prevented (in whole or in part) because of circumstances beyond our control (including but not limited to failure of systems, failure of our suppliers, acts of nature, epidemic or pandemic, time access inaccuracies, inclement weather, site access failure, civil commotion and\/or unrest or riots, civil or military interference including acts of war or terror), we are not liable for failure to perform our obligations due to such events, provided that we are without substantial fault or negligence and provided we give notice to you of the delay and use reasonable efforts to remedy the cause of the delay.<\/p>\n<h3>PRIVACY<\/h3>\n<p>Where you provide us with your personal information (as defined under the <a href=\"https:\/\/lullyandrose.com.au\/privacy-policy-gold-coast-florist\/\">Privacy Act<\/a>), you agree and consent to provide that information to us for the purposes set out in these terms and in any privacy policy published by us from time to time. We may collect, use and disclose that personal information for all purposes relating to your order or booking or fulfilling our obligations under these terms. This includes processing the order, preparing and delivering of product, market research, business development, marketing and debt collection.<\/p>\n<p>You agree we may use your image and name for promotional purposes or on our social media pages. You may advise us at any time if you do not agree to such use.<\/p>\n<p>We may exchange personal information supplied by you with our related bodies corporate and our service providers that help us operate our business.<\/p>\n<h3>COPYRIGHT, TRADEMARK AND RESTRICTIONS OF USE<\/h3>\n<p>This website contains material which is owned by or licensed to us. This material includes, but is not limited to, the design, layout, look, appearance, name, trade marks (registered or otherwise) and graphics. You are not permitted to reproduce the documents, information or materials on the website for the purposes of sale or the use by any third party. In particular you are not permitted to republish, upload, transmit electronically or otherwise or distribute any of the materials, documents or products that may be available for download from time to time on this website.<\/p>\n<p>Lully &amp; Rose Floral Studio expressly reserves all copyright and trademark in its website and in all documents, information and content on its website and reserves the right to take action against you if you breach any of these terms. Any redistribution or reproduction of part or all of the contents in any form is prohibited other than the following: you may print or download one copy for your personal and non-commercial use only; and you may copy the content to individual third parties for their personal use, but only if you acknowledge the website as the source of the material.<\/p>\n<p>You may not, except with our express written permission, distribute or commercially exploit the content. Nor may you transmit it or store it in any other website or other form of electronic retrieval system.<\/p>\n<h3>JURISDICTION<\/h3>\n<p>These terms and this website are subject to the laws of Queensland, Australia and you submit to the jurisdiction of the <a href=\"https:\/\/www.courts.qld.gov.au\/courts\">courts of Queensland<\/a>.<\/p>\n<h3>WHOLE AGREEMENT<\/h3>\n<p>These terms represent the whole agreement between you and Lully &amp; Rose Floral Studio concerning your purchase of our products, your use and access of our website and your use and access of the documents and information on it. No prior correspondence, nor any other term, forms part of these terms or affects their interpretation except where it is required to be included by any legislation of the Commonwealth or any State or Territory. All implied terms except those implied by statute and which cannot be expressly excluded are hereby expressly excluded.<\/p>\n<h3>CHANGES TO THESE TERMS<\/h3>\n<p>We may at any time vary the terms applicable to future bookings and may notify you of the changes or provide any other notice under or in connection with these terms by email. We may also vary these terms at any time by publishing the revised terms on our website and the revised terms become effective from the date of publication.<\/p>\n\t\t\n<style>\n#text-2545425466 {\n  font-size: 0.9rem;\n}\n<\/style>\n\t<\/div>\n\t\n\t\t<\/div>\n\t<\/div>\n\t\n\t<div id=\"accordion-1736131508\" class=\"accordion-item\">\n\t\t<a id=\"accordion-1736131508-label\" class=\"accordion-title plain\" href=\"#accordion-item-2.-terms-applicable-to-events,-special-occasions-(weddings,-events,-corporate-and-hire)\" aria-expanded=\"false\" aria-controls=\"accordion-1736131508-content\" >\n\t\t\t<button class=\"toggle\" aria-label=\"Toggle\"><i class=\"icon-angle-down\"><\/i><\/button>\n\t\t\t<span>2. TERMS APPLICABLE TO EVENTS, SPECIAL OCCASIONS (WEDDINGS, EVENTS, CORPORATE AND HIRE)<\/span>\n\t\t<\/a>\n\t\t<div id=\"accordion-1736131508-content\" class=\"accordion-inner\" aria-labelledby=\"accordion-1736131508-label\" >\n\t\t\t\n<span class=\"scroll-to\" data-label=\"Scroll to: #2.-terms-applicable-to-events,-special-occasions-(weddings,-events,-corporate-and-hire)\" data-bullet=\"false\" data-link=\"#2.-terms-applicable-to-events,-special-occasions-(weddings,-events,-corporate-and-hire)\" data-title=\"2. Terms applicable to events, special occasions (Weddings, Events, Corporate and Hire)\" ><a name=\"2.-terms-applicable-to-events,-special-occasions-(weddings,-events,-corporate-and-hire)\"><\/a><\/span>\n<div class=\"container section-title-container\" style=\"margin-bottom:0px;\"><h2 class=\"section-title section-title-bold\"><b><\/b><span class=\"section-title-main\" >2. TERMS APPLICABLE TO EVENTS, SPECIAL OCCASIONS (WEDDINGS, EVENTS, CORPORATE AND HIRE)<\/span><b><\/b><\/h2><\/div>\n\t<div id=\"text-3265100134\" class=\"text\">\n\t\t\n<h3>PEAK PERIODS<\/h3>\n<p>Premium dates incur higher prices due to factors that are outside our control. These dates include, but are not limited to:<\/p>\n<p>2 weeks before and 2 weeks after February 14th;<br \/>\n2 weeks before and 2 weeks after Mother’s Day;<br \/>\n2 weeks before and 2 weeks after Christmas Day; and<br \/>\n2 weeks before and 2 weeks after New Year’s Eve.<\/p>\n<h3>DATE AVAILABILITY<\/h3>\n<p>For weddings, corporate events and hire, dates may be booked a maximum of eighteen (18) months in advance. If your chosen date is available, you will be offered a consultation and following the consultation, we will provide you with a quotation. The chosen date remains allocated to you (the client) until the conclusion of the quotation validity.<\/p>\n<h3>CONSULTATION<\/h3>\n<p>You will be offered a consultation with Lully &amp; Rose Floral Studio.  For weddings and corporate events, you must attend a consultation with us in order to obtain a quotation. Should you not be able to attend an in-person consultation, you will be offered a phone consultation. The initial consultation will run for a maximum of thirty (30) minutes; should the consultation run more than 30 minutes, a further consultation fee will be charged from $60 per hour or part thereof.<\/p>\n<p>If you cannot attend your consultation and need to rebook, please provide 48 hours notice.<\/p>\n<h3>FURTHER CONSULTATION(s) UPON REQUEST<\/h3>\n<p>You may arrange an additional consultation\/s with Lully &amp; Rose Floral Studio prior to the event. Often, details can be clarified or confirmed by email\/phone, however in the event of an additional in-person meeting\/s requested by you, further consultations or site visits will be charged from $60 per hour or part thereof.<\/p>\n<p>Whilst we acknowledge, understand and respect that your event is a very important day, we discourage excessive email(s) &amp; call(s) to our business in the lead up to your event date. We ask that communication is kept as transparent as possible and that both parties take advantage of the scheduled meeting time(s).<\/p>\n<h3>QUOTATION<\/h3>\n<p>A quotation will be sent to you by email, within twenty-one (21) days of attending a consultation with us. Should we experience delays in providing it to you during this time due to supplier responses, we’ll advise accordingly. A maximum of three (3) revisions can be made to your order by email without incurring an administration fee.<\/p>\n<h3>QUOTATION VALIDITY<\/h3>\n<p>Quotations are valid for fourteen (14) days. We will contact you at the conclusion of the validity period to confirm. Upon accepting the quote, you agree to pay for all the items listed on the quotation.  Should we have no contact from you at the conclusion of the validity, we will assume you have forfeited the quotation and rescind effective immediately.<\/p>\n<h3>SECURING YOUR BOOKING \/ PAYMENT OF DEPOSIT<\/h3>\n<p>For weekly floral arrangements, full payment is required upfront.<\/p>\n<p>For weddings, corporate events, hire and other events, a booking is only confirmed once our requested deposit has been received in accordance with the following process:<\/p>\n<ul>\n<li>Once you have advised you wish to proceed, a Tax Invoice is issued for the agreed amount and a 40% deposit is required to secure the booking.<\/li>\n<li>We accept no responsibility if you have a valid quote and wish to book, but your date has become booked out\/unavailable.  Bookings will not be held without a deposit.<\/li>\n<li>The final balance payment is required three (3) weeks prior to the event date.  Lully &amp; Rose Floral Studio is not responsible for contacting you or reminding you of the final payment cut-off date.<\/li>\n<li>Should you fail to pay the balance of your payment as per your quotation, we reserve the right to cancel your order effective immediately with no refund on any deposit and\/or previous monies paid.<\/li>\n<\/ul>\n<p>The deposit is not refundable other than where permitted by these terms.<\/p>\n<p>Please check your order confirmation carefully, as Lully &amp; Rose Floral Studio takes no responsibility for any errors or omissions once you have confirmed your final order.<\/p>\n<h3>FORMS OF PAYMENT<\/h3>\n<p>Payments can be made by EFT, Credit Card or PayPal or by any other third party payment provider we may use from time to time. Some credit card payments may be subject to surcharge, which will be outlined on your quotation and\/or invoice(s). Cheques are not accepted.<\/p>\n<h3>LATE PAYMENT<\/h3>\n<p>Lully &amp; Rose Floral Studio will not order your wedding\/event flowers or complete any arrangements without final payment.  Delayed final payment will result in a late flower order and may impact upon your event.  Lully &amp; Rose Floral Studio will not be held accountable for disappointment or dissatisfaction due to late payment.  If we incur any costs due to your payment being late (such as interest or debt recovery costs), we reserve the right to pass those costs on to you.<\/p>\n<h3>AMENDMENTS TO YOUR ORDER<\/h3>\n<p>By making a deposit or full payment, you are acknowledging that your order will be as listed in its original quantity, scale and format. A reduction in your order (whether to quantities, products or total spend) is not possible as Lully &amp; Rose Floral Studio may have forfeited other bookings to accommodate your original order size\/scale.<\/p>\n<p>If you would like to add to your order, please provide us with the final details at least thirty (30) days prior to the event to guarantee availability.<\/p>\n<h3>TRIAL<\/h3>\n<p>Should you wish to conduct a trial of any part of your order, this can be arranged. The cost will be the same as what the individual item is listed on your quotation. This amount is payable prior to the scheduled trial.<\/p>\n<h3>CANCELLATION<\/h3>\n<p>In the unlikely event of your event being cancelled, Lully &amp; Rose Floral Studio require a minimum of thirty (30) days notice, in writing (by email).<\/p>\n<p>If a cancellation is made with more than 30 days notice, a full refund of all money paid, less the non-refundable 40% deposit amount, less any perishable and non-perishable items purchased on your behalf for your wedding\/event, such as vases, ribbons etc.<\/p>\n<p>Cancellations made within thirty (30) days of the wedding\/event date will result in you forfeiting the complete amount paid.<\/p>\n<h3>COVID-19<\/h3>\n<p>If you no longer want to hold your event on the chosen date due to government restrictions on the numbers of guests permitted at a wedding\/event because of <a href=\"https:\/\/www.covid19.qld.gov.au\">COVID-19<\/a>, we will allow you the option of either:<\/p>\n<ul>\n<li>cancelling your wedding\/event, in which case you may be entitled to a partial refund in accordance with the clause above (CANCELLATION); or<\/li>\n<li>postponing your wedding\/event date to a new date, in which case you may be entitled to transfer your part-payment to a new date or obtain a partial refund in accordance with the following clause (POSTPONEMENT),<\/li>\n<\/ul>\n<p>provided that in either case, you have given us at least 30 days notice (in writing or via email) of your decision to postpone or cancel.<\/p>\n<h3>POSTPONEMENT<\/h3>\n<p>In the unlikely event you need to postpone your event, Lully &amp; Rose Floral Studio require a minimum of thirty (30) days notice, in writing (by email). If your requested date is available, Lully &amp; Rose Floral Studio will transfer the deposit\/money paid to the new requested date.<\/p>\n<p>If you postpone with more than thirty (30) days notice, and the new requested date is unavailable, we will provide you with a full refund of all money paid, less the non-refundable 40% deposit amount.<\/p>\n<p>If you postpone within thirty (30) days of the wedding\/event date and the new requested date is unavailable, this will result in loss of the complete amount paid.<\/p>\n<h3>SET-UP\/DELIVERY<\/h3>\n<p>Times are outlined on a run-sheet given to you prior to the event. Whilst every endeavour will be made to adhere to this run-sheet, you acknowledge there may be situations out of our control which lead to delays (roadworks, accidents, breakdowns) and you agree we will not be held liable for losses or delays caused by those circumstances.<\/p>\n<p>Lully &amp; Rose Floral Studio accepts no responsibility for items supplied by third parties or otherwise arranged by you, such as those that are not fit for use (unsafe or not suitable to bear weight) and\/or not delivered on time, forcing the job to not be executed as planned. For example if an arbour hired by you from a third party is not delivered on time, this may mean we are unable to set up according to the original schedule as arranged with you. Every effort will always be made to achieve the best possible outcome.<\/p>\n<p>Should you require the delivery of bridal flowers, buttonholes, centrepieces etc to be delivered to separate individual locations, additional delivery fees will apply.  Delivery fees will be outlined in your quotation.<\/p>\n<p>The delivery details including addresses are confirmed two (2) weeks prior to the wedding\/event date. It is your responsibility to provide us with the correct delivery details.<\/p>\n<h3>PERMISSION TO ACCESS VENUE<\/h3>\n<p>You are responsible for seeking permission for Lully &amp; Rose Floral Studio to access any premises required to complete the job in the venue(s) outlined as per the agreed quotation. This includes seeking permission to hang\/suspend florals and\/or décor, naked flames, grass spikes and attend to any other elements of your requested design (including those which may cause damage to the premises). Notwithstanding that we will use our best endeavours not to cause any damage to venues or event premises, you agree you are liable for any damage caused to the event premises where such damage results from a design or arrangement that you have requested.<\/p>\n<p>Lully &amp; Rose Floral Studio accepts no responsibility should elements of the quotation be unable to be carried out due to lack of <a href=\"https:\/\/www.oir.qld.gov.au\/workplace-health-and-safety-queensland\">Occupational Health &amp; Safety<\/a> at the venue(s) not be met, putting our team members in danger to complete the task.<\/p>\n<h3>REFUSAL OF SERVICE<\/h3>\n<p>Lully &amp; Rose Floral Studio reserves the right to decline any order. We also reserve the right to choose not to work with third parties such as stylists, planners and venues if we don’t feel they’re a suitable on-par fit for our work and ethics.<\/p>\n<h3>EXCLUSIVITY, ADVERTISING &amp; PHOTOGRAPHY<\/h3>\n<p>Lully &amp; Rose Floral Studio retain the right to photograph all finished work and use photographs of your wedding\/event which may be used in self promotion, advertising, magazine submissions and other publications related to event advertising. Lully &amp; Rose Floral Studio agrees to hold off from posting any images to social media until after the wedding ceremony\/event has begun.<\/p>\n<p>Lully &amp; Rose Floral Studio reserves the right to be retained as the exclusive Florist to complete the entire job. Exceptions may be décor\/hired items, which can be negotiated individually. Strictly no other florist, fresh\/artificial flower supplier can be engaged in conjunction with us for your wedding\/event.<\/p>\n<h3>DISPUTES<\/h3>\n<p>Any form of feedback or dispute regarding your wedding\/event will only be entered into within 24 hours of the event. Any communication must be received by email.<\/p>\n\t\t\n<style>\n#text-3265100134 {\n  font-size: 0.9rem;\n}\n<\/style>\n\t<\/div>\n\t\n\t\t<\/div>\n\t<\/div>\n\t\n\t<div id=\"accordion-2505616\" class=\"accordion-item\">\n\t\t<a id=\"accordion-2505616-label\" class=\"accordion-title plain\" href=\"#accordion-item-3.-additional-terms-applicable-to-weddings-and-events\" aria-expanded=\"false\" aria-controls=\"accordion-2505616-content\" >\n\t\t\t<button class=\"toggle\" aria-label=\"Toggle\"><i class=\"icon-angle-down\"><\/i><\/button>\n\t\t\t<span>3. ADDITIONAL TERMS APPLICABLE TO WEDDINGS AND EVENTS<\/span>\n\t\t<\/a>\n\t\t<div id=\"accordion-2505616-content\" class=\"accordion-inner\" aria-labelledby=\"accordion-2505616-label\" >\n\t\t\t\n<span class=\"scroll-to\" data-label=\"Scroll to: #3.-additional-terms-applicable-to-weddings-and-events\" data-bullet=\"false\" data-link=\"#3.-additional-terms-applicable-to-weddings-and-events\" data-title=\"3. Additional Terms applicable to Weddings and Events\" ><a name=\"3.-additional-terms-applicable-to-weddings-and-events\"><\/a><\/span>\n<div class=\"container section-title-container\" style=\"margin-bottom:0px;\"><h2 class=\"section-title section-title-bold\"><b><\/b><span class=\"section-title-main\" >3. ADDITIONAL TERMS APPLICABLE TO WEDDINGS AND EVENTS<\/span><b><\/b><\/h2><\/div>\n\t<div id=\"text-1969199108\" class=\"text\">\n\t\t\n<h3>MINIMUM SPEND<\/h3>\n<p><i>Full Service Wedding (Bridal Party\/Ceremony\/Reception etc):<\/i><br \/>\nMonday to Friday Wedding Dates $3,500 including GST<br \/>\nSaturday &amp; Sunday Wedding Dates $4,500 including GST<br \/>\nPublic Holiday Wedding Dates $5,500 including GST<\/p>\n<p><i>Bridal Party Only Wedding (Bride, Bridesmaids, Groom, Groomsmen):<\/i><br \/>\nMonday to Friday Wedding Dates $1,000 including GST<br \/>\nSaturday &amp; Sunday Wedding Dates $1,500 including GST<br \/>\nPublic Holiday Wedding Dates $2,500 including GST<\/p>\n\t\t\n<style>\n#text-1969199108 {\n  font-size: 0.9rem;\n}\n<\/style>\n\t<\/div>\n\t\n\t\t<\/div>\n\t<\/div>\n\t\n\t<div id=\"accordion-3466195737\" class=\"accordion-item\">\n\t\t<a id=\"accordion-3466195737-label\" class=\"accordion-title plain\" href=\"#accordion-item-4.-additional-terms-applicable-to-weekly-floral-arrangements-and-corporate-clients\" aria-expanded=\"false\" aria-controls=\"accordion-3466195737-content\" >\n\t\t\t<button class=\"toggle\" aria-label=\"Toggle\"><i class=\"icon-angle-down\"><\/i><\/button>\n\t\t\t<span>4. ADDITIONAL TERMS APPLICABLE TO WEEKLY FLORAL ARRANGEMENTS AND CORPORATE CLIENTS<\/span>\n\t\t<\/a>\n\t\t<div id=\"accordion-3466195737-content\" class=\"accordion-inner\" aria-labelledby=\"accordion-3466195737-label\" >\n\t\t\t\n<span class=\"scroll-to\" data-label=\"Scroll to: #4.-additional-terms-applicable-to-weekly-floral-arrangements-and-corporate-clients\" data-bullet=\"false\" data-link=\"#4.-additional-terms-applicable-to-weekly-floral-arrangements-and-corporate-clients\" data-title=\"4. Additional Terms applicable to weekly floral arrangements and corporate clients\" ><a name=\"4.-additional-terms-applicable-to-weekly-floral-arrangements-and-corporate-clients\"><\/a><\/span>\n<div class=\"container section-title-container\" style=\"margin-bottom:0px;\"><h2 class=\"section-title section-title-bold\"><b><\/b><span class=\"section-title-main\" >4. ADDITIONAL TERMS APPLICABLE TO WEEKLY FLORAL ARRANGEMENTS AND CORPORATE CLIENTS<\/span><b><\/b><\/h2><\/div>\n\t<div id=\"text-2213746958\" class=\"text\">\n\t\t\n<h3>WEEKLY FLORAL ARRANGEMENTS<\/h3>\n<h3>MINIMUM SPEND<\/h3>\n<p>Monday to Friday $115 including GST<br \/>\nSaturday &amp; Sunday $300 including GST<br \/>\nPublic Holiday $550 including GST<\/p>\n<h3>BOOKING &amp; PAYMENT<\/h3>\n<p>A booking is only confirmed once a payment has been received.  Payments for all floral arrangement\/s are required to be paid upfront.<\/p>\n\t\t\n<style>\n#text-2213746958 {\n  font-size: 0.9rem;\n}\n<\/style>\n\t<\/div>\n\t\n\t\t<\/div>\n\t<\/div>\n\t\n\t<div id=\"accordion-2621151523\" class=\"accordion-item\">\n\t\t<a id=\"accordion-2621151523-label\" class=\"accordion-title plain\" href=\"#accordion-item-5.-additional-terms-applicable-to-hire-items\" aria-expanded=\"false\" aria-controls=\"accordion-2621151523-content\" >\n\t\t\t<button class=\"toggle\" aria-label=\"Toggle\"><i class=\"icon-angle-down\"><\/i><\/button>\n\t\t\t<span>5. ADDITIONAL TERMS APPLICABLE TO HIRE ITEMS<\/span>\n\t\t<\/a>\n\t\t<div id=\"accordion-2621151523-content\" class=\"accordion-inner\" aria-labelledby=\"accordion-2621151523-label\" >\n\t\t\t\n<span class=\"scroll-to\" data-label=\"Scroll to: #5.-additional-terms-applicable-to-hired-items\" data-bullet=\"false\" data-link=\"#5.-additional-terms-applicable-to-hired-items\" data-title=\"5. Additional Terms applicable to hired items\" ><a name=\"5.-additional-terms-applicable-to-hired-items\"><\/a><\/span>\n<div class=\"container section-title-container\" style=\"margin-bottom:0px;\"><h2 class=\"section-title section-title-bold\"><b><\/b><span class=\"section-title-main\" >5. ADDITIONAL TERMS APPLICABLE TO HIRE ITEMS<\/span><b><\/b><\/h2><\/div>\n\t<div id=\"text-423585503\" class=\"text\">\n\t\t\n<h3>CONSULTATION UPON REQUEST ONLY<\/h3>\n<p>If you have requested a consultation with Lully &amp; Rose Floral Studio, a suitable time and date will be arranged.  You must attend a consultation with us in order to obtain a quotation. Should you not be able to attend an in-person consultation, you will be offered a phone consultation.<\/p>\n<p>The requested consultation will run for thirty (30) minutes; if you require more than 30 minutes, a further consultation fee will be charged from $60 per hour or part thereof.<\/p>\n<h3>FURTHER CONSULTATION(s) UPON REQUEST ONLY<\/h3>\n<p>If requested, you can arrange additional consultation\/s with Lully &amp; Rose Floral Studio. Often, details can be clarified or confirmed by email\/phone, however in the event of an additional in-person meeting\/s, further consultations or site visits will be charged from $60 per hour or part thereof.<\/p>\n<p>Whilst we acknowledge, understand and respect that a wedding\/event is a very important day, we discourage excessive email(s) &amp; call(s) to our business in the lead up to your wedding\/event. We ask that communication is kept as transparent as possible and that both parties take advantage of the scheduled meeting time.<\/p>\n<h3>SECURITY BOND<\/h3>\n<p>An additional Security Bond of $250 is required in addition to the deposit and payment is required three (3) weeks prior to the hire date.  The Security Bond will be refunded after the hire; less any incidentals or damage.<\/p>\n<h3>INSPECTION<\/h3>\n<p>Lully &amp; Rose Floral Studio ensures all hire equipment is thoroughly checked and cleaned prior to delivery or collection from our premises.  You are responsible for inspecting all of the ordered hire equipment upon delivery or collection and notifying the Lully &amp; Rose Floral Studio of any damage, discrepancies or missing items within 2 hours of receiving the hire equipment.  Unless you notify us otherwise following your receipt and inspection of the items, you are deemed to have accepted that the hire equipment is:<\/p>\n<p>a) clean;<br \/>\nb) in satisfactory working order\/fit for purpose; and<br \/>\nc) of the quantity and specifications as ordered.<\/p>\n<p>If you do not advise us of issues with the product within 2 hours or receiving the product, then we may not be liable to resupply or amend your hire order.<\/p>\n<h3>SET-UP\/DELIVERY<\/h3>\n<p>Unless otherwise stated on invoice delivery, pick up and setup charges are extra. Any quoted charges are for the delivery suburb and based on appropriate vehicle access (of maximum 25 metres to the delivery point from the delivery vehicle).<\/p>\n<p>There must be a site contact available at all times during the delivery and collection days to sign for both the delivery and collection. You must provide Lully &amp; Rose Floral Studio with the name\/s of this person\/s and contact details.  Drop off access must be arranged by you prior to driver arriving.<\/p>\n<p>You must be available (or arrange someone to be available) at the delivery site to help lift the hire items on arrival. All hire items must be returned as they were received and stored in an accessible, dry and secure place ready for collection.  If any hire items are not ready for pickup at designated time and causes delay to our staff which then requires our staff to pack up items will incur additional fees which will be charged at an hourly rate of $60per hour; this will be charged to you.<\/p>\n<p>If Lully &amp; Rose Floral Studio is setting up the hire item\/s, you are responsible for allowing sufficient time and access to the venue for setup. In this instance an additional fee could be charged if we need to put on extra staff due to time restrictions at delivery location.<\/p>\n<h3>POSITIONING OF HIRE ITEM\/S DELIVERED<\/h3>\n<p>Although Lully &amp; Rose Floral Studio will endeavour to take every care when delivering, installing, dismantling and picking up equipment, it shall not be liable for any damage or loss to the site, site access or plants and you shall indemnify Lully &amp; Rose Floral Studio from and against all actions, claims, costs, demands and liabilities in connection there with.  Any resulting additional costs, including reasonably incurred legal costs by Lully &amp; Rose Floral Studio, must be paid by you. All equipment is not to be removed from delivery location unless prior approval by Lully &amp; Rose Floral Studio.  If setup has been requested and venue is not ready prior to delivery we will place all items off to one side. Additional $120 fee will be charged if we have to return to your site to set up.<\/p>\n<h3>USE OF EQUIPMENT<\/h3>\n<p>You agree only to use the hire equipment for the proper purpose for which it is designed and no other purpose.<\/p>\n<p>Damage to hire items that occurs while the items are in your possession or at the event venue, is your responsibility. In no event shall Lully &amp; Rose Floral Studio be responsible for any expenditure, damages or consequential loss incurred by you, invitees, agents or assigns arising out of any failure of the equipment due to misuse or negligence, except to the extent that the failure was because of fair wear and tear or negligence on the part of Lully &amp; Rose Floral Studio.<\/p>\n<h3>EQUIPMENT FAULTS<\/h3>\n<p>If at any time during the hire period you consider the hire item\/s to be faulty, it is your responsibility to contact Lully &amp; Rose Floral Studio in the first instance by telephone or in writing via email to report the problem. Failure to do so, or advice after use, will cause you to be responsible for all hire charges, and repair or replacement cost if necessary. Lully &amp; Rose Floral Studio reserves the right to repair or replace the faulty item\/s as soon as practical during the hire period to your reasonable satisfaction. On no account should you attempt to repair the hire item\/s without our prior consent.<\/p>\n<p>Call out charges based on time taken will be charged to you, relative to the time of day, if the hire item\/s is proven to be satisfactory by Lully &amp; Rose Floral Studio and not faulty as claimed by you.<\/p>\n<h3>COLLECTION<\/h3>\n<p>You shall on completion of the hire period, ensure that the hire item\/s is returned as it was received when delivered or collected. Extra charges apply if hire item\/s requires re-packing by delivery \/ pick up staff prior to transportation. Any hire item\/s broken during transportation due to you (being negligent in re-packing will be charged at full replacement value.<\/p>\n<p>Hire items must be left in the designated venue for us to collect following your event. Should the items not be available as arranged, a further collection fee will apply.<\/p>\n<h3>OWNERSHIP<\/h3>\n<p>The equipment supplied for hire remains the property of the Lully &amp; Rose Floral Studio.<\/p>\n<h3>LOSS, DAMAGE AND CLEANING<\/h3>\n<p>You are responsible for the safety, cleanliness and structural integrity of all items you hire from us excluding normal wear &amp; tear. You are responsible for the costs of replacing or repairing any lost, stolen, broken items or items showing excessive wear &amp; tear.<\/p>\n<p>You accept full responsibility to compensate Lully &amp; Rose Floral Studio for the value of the hire item\/s, or parts thereof which may be lost, stolen, damaged or broken during the hire period. A cleaning or repair charge will be applied to all goods returned dirty or damaged and charged to you.<\/p>\n<p>If upon the return of the hire item\/s, Lully &amp; Rose Floral Studio finds the equipment to be dirty or not in satisfactory working condition, you must pay Lully &amp; Rose Floral Studio the costs and expenses of cleaning and restoring the hire item\/s to good working order. We may in our discretion determine whether an item will be suitable for repair or if it is beyond repair, if it must be replaced, and you agree to bear the costs of such repair or replacement. Replacement costs of lost, misplaced and damaged items will be charged at replacement value, on the return date stated on the Tax Invoice, unless agreed otherwise. This right shall not be prejudiced by or prejudice any other right under these terms.<\/p>\n<h3>LIABILITY TO THIRD PARTIES<\/h3>\n<p>You hereby indemnify and hold indemnified Lully &amp; Rose Floral Studio from and against all claims, actions, suits, demands and expenses in any way arising from injury, death, loss of income or damage caused to you or your property, or any other third parties or property, in respect of hired item\/s which you misuse or fail to care for in accordance with these terms.<\/p>\n\t\t\n<style>\n#text-423585503 {\n  font-size: 0.9rem;\n}\n<\/style>\n\t<\/div>\n\t\n\t\t<\/div>\n\t<\/div>\n\t\n\t<div id=\"accordion-1496695894\" class=\"accordion-item\">\n\t\t<a id=\"accordion-1496695894-label\" class=\"accordion-title plain\" href=\"#accordion-item-6.-additional-terms-applicable-to-workshops\" aria-expanded=\"false\" aria-controls=\"accordion-1496695894-content\" >\n\t\t\t<button class=\"toggle\" aria-label=\"Toggle\"><i class=\"icon-angle-down\"><\/i><\/button>\n\t\t\t<span>6. ADDITIONAL TERMS APPLICABLE TO WORKSHOPS<\/span>\n\t\t<\/a>\n\t\t<div id=\"accordion-1496695894-content\" class=\"accordion-inner\" aria-labelledby=\"accordion-1496695894-label\" >\n\t\t\t\n<span class=\"scroll-to\" data-label=\"Scroll to: #6.-additional-terms-applicable-to-workshops\" data-bullet=\"false\" data-link=\"#6.-additional-terms-applicable-to-workshops\" data-title=\"6. Additional Terms applicable to Workshops\" ><a name=\"6.-additional-terms-applicable-to-workshops\"><\/a><\/span>\n<div class=\"container section-title-container\" style=\"margin-bottom:0px;\"><h2 class=\"section-title section-title-bold\"><b><\/b><span class=\"section-title-main\" >6. ADDITIONAL TERMS APPLICABLE TO WORKSHOPS<\/span><b><\/b><\/h2><\/div>\n\t<div id=\"text-1568778426\" class=\"text\">\n\t\t\n<h3>BOOKING<\/h3>\n<p>Bookings will not be held without a deposit being paid. A booking is only confirmed once payment has been received in full.<\/p>\n<h3>CANCELLTION<\/h3>\n<p>In the unlikely event you need to cancel, Lully &amp; Rose Floral Studio require a minimum of thirty (30) days notice, in writing (by email).<\/p>\n<p>If a cancellation is made with more than 30 days notice, you will receive a full refund of all money paid.<\/p>\n<p>If a cancellation is made within 30 to 7 days of the Workshop date, you will receive a refund of 50% of all money paid.<\/p>\n<p>If a cancellation is made within 7 days of the Workshop date, you will result in the loss of the complete amount paid.<\/p>\n<h3>MAXIMUM\/MINIMUM NUMBERS<\/h3>\n<p>There is a maximum and minimum number of students per class.  If the minimum number of students is not achieved within one (1) week of the workshop date, the workshop may be cancelled.  Lully &amp; Rose Floral Studio will offer you a full refund or a credit of the same value to attend a Workshop within a twelve (12) month period.<\/p>\n<h3>APPROPRIATE FOOTWEAR<\/h3>\n<p>To ensure your safety, non-slip closed-in shoes must be worn to all classes. No thongs, open footwear or high heels are permitted.  While all care is taken, you are responsible for your own safety and property when travelling to\/from and attending a Workshop at Lully &amp; Rose Floral Studio or a third party premises.<\/p>\n<h3>EXCLUSIVITY, ADVERTISING &amp; PHOTOGRAPHY<\/h3>\n<p>Lully &amp; Rose Floral Studio retain the right to photograph all finished work and photograph participants during the Workshop which may be used in self promotion, advertising, magazine submissions and other publications related to advertising.<\/p>\n\t\t\n<style>\n#text-1568778426 {\n  font-size: 0.9rem;\n}\n<\/style>\n\t<\/div>\n\t\n\t\t<\/div>\n\t<\/div>\n\t\n<\/div>\n<div class=\"row\"  id=\"row-719881656\">\n\n\t<div id=\"col-1993997093\" class=\"col small-12 large-12\"  >\n\t\t\t\t<div class=\"col-inner\"  >\n\t\t\t\n\t\t\t\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\n\t\n\n\t<div id=\"col-1169953565\" class=\"col small-12 large-12\"  >\n\t\t\t\t<div class=\"col-inner\"  >\n\t\t\t\n\t\t\t\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\n\t\n\n\t<div id=\"col-1531769284\" class=\"col small-12 large-12\"  >\n\t\t\t\t<div class=\"col-inner\"  >\n\t\t\t\n\t\t\t\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\n\t\n\n\t<div id=\"col-1484608357\" class=\"col small-12 large-12\"  >\n\t\t\t\t<div class=\"col-inner\"  >\n\t\t\t\n\t\t\t\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\n\t\n\n\t<div id=\"col-134565541\" class=\"col small-12 large-12\"  >\n\t\t\t\t<div class=\"col-inner\"  >\n\t\t\t\n\t\t\t\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\n\t\n\n\t<div id=\"col-951648799\" class=\"col small-12 large-12\"  >\n\t\t\t\t<div class=\"col-inner\"  >\n\t\t\t\n\t\t\t\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\n\t\n<\/div>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-blank-title-center.php","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-19","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v23.1 (Yoast SEO v23.4) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Terms &amp; Conditions | Gold Coast Florist - LULLY &amp; ROSE Floral Studio<\/title>\n<meta name=\"description\" content=\"LULLY &amp; ROSE Floral Studio, a luxury Gold Coast florist. Read our Terms &amp; Conditions for LULLY &amp; ROSE Floral Studio.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/lullyandrose.com.au\/terms-conditions\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Terms &amp; Conditions\" \/>\n<meta property=\"og:description\" content=\"LULLY &amp; ROSE Floral Studio, a luxury Gold Coast florist. Read our Terms &amp; Conditions for LULLY &amp; ROSE Floral Studio.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/lullyandrose.com.au\/terms-conditions\/\" \/>\n<meta property=\"og:site_name\" content=\"LULLY &amp; ROSE Floral Studio\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/lullyandrose\/\" \/>\n<meta property=\"article:modified_time\" content=\"2023-08-16T08:40:47+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2020\/04\/Lully-Rose-Logo-Final-RGB-Rose-Gold-Gradient.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1258\" \/>\n\t<meta property=\"og:image:height\" content=\"501\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"31 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/lullyandrose.com.au\/terms-conditions-gold-coast-florist\/\",\"url\":\"https:\/\/lullyandrose.com.au\/terms-conditions\/\",\"name\":\"Terms & Conditions | Gold Coast Florist - LULLY &amp; ROSE Floral Studio\",\"isPartOf\":{\"@id\":\"https:\/\/lullyandrose.com.au\/#website\"},\"datePublished\":\"2020-04-20T18:57:58+00:00\",\"dateModified\":\"2023-08-16T08:40:47+00:00\",\"description\":\"LULLY & ROSE Floral Studio, a luxury Gold Coast florist. Read our Terms & Conditions for LULLY & ROSE Floral Studio.\",\"breadcrumb\":{\"@id\":\"https:\/\/lullyandrose.com.au\/terms-conditions\/#breadcrumb\"},\"inLanguage\":\"en-AU\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/lullyandrose.com.au\/terms-conditions\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/lullyandrose.com.au\/terms-conditions\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/lullyandrose.com.au\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Terms &#038; Conditions\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/lullyandrose.com.au\/#website\",\"url\":\"https:\/\/lullyandrose.com.au\/\",\"name\":\"LULLY &amp; ROSE Floral Studio\",\"description\":\"LULLY &amp; ROSE Floral Studio\",\"publisher\":{\"@id\":\"https:\/\/lullyandrose.com.au\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/lullyandrose.com.au\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-AU\"},{\"@type\":[\"Organization\",\"Place\"],\"@id\":\"https:\/\/lullyandrose.com.au\/#organization\",\"name\":\"Lully & Rose Floral Studio\",\"url\":\"https:\/\/lullyandrose.com.au\/\",\"logo\":{\"@id\":\"https:\/\/lullyandrose.com.au\/terms-conditions\/#local-main-organization-logo\"},\"image\":{\"@id\":\"https:\/\/lullyandrose.com.au\/terms-conditions\/#local-main-organization-logo\"},\"sameAs\":[\"https:\/\/www.facebook.com\/lullyandrose\/\",\"https:\/\/www.instagram.com\/lullyandrose\/\"],\"telephone\":[\"0481 810 535\"],\"openingHoursSpecification\":[{\"@type\":\"OpeningHoursSpecification\",\"dayOfWeek\":[\"Monday\",\"Thursday\",\"Friday\",\"Saturday\"],\"opens\":\"10:00\",\"closes\":\"14:00\"},{\"@type\":\"OpeningHoursSpecification\",\"dayOfWeek\":[\"Tuesday\",\"Wednesday\",\"Sunday\"],\"opens\":\"00:00\",\"closes\":\"00:00\"}],\"email\":\"lullyandrose@hotmail.com\",\"areaServed\":\"Gold Coast\",\"vatID\":\"27 658 759 727\",\"taxID\":\"GST\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-AU\",\"@id\":\"https:\/\/lullyandrose.com.au\/terms-conditions\/#local-main-organization-logo\",\"url\":\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2020\/04\/Lully-Rose-Logo-Final-RGB-Rose-Gold-Gradient.jpg\",\"contentUrl\":\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2020\/04\/Lully-Rose-Logo-Final-RGB-Rose-Gold-Gradient.jpg\",\"width\":1258,\"height\":501,\"caption\":\"Lully & Rose Floral Studio\"}]}<\/script>\n<meta name=\"geo.placename\" content=\"Gold Coast\" \/>\n<meta name=\"geo.region\" content=\"Australia\" \/>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Terms & Conditions | Gold Coast Florist - LULLY &amp; ROSE Floral Studio","description":"LULLY & ROSE Floral Studio, a luxury Gold Coast florist. Read our Terms & Conditions for LULLY & ROSE Floral Studio.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/lullyandrose.com.au\/terms-conditions\/","og_locale":"en_US","og_type":"article","og_title":"Terms & Conditions","og_description":"LULLY & ROSE Floral Studio, a luxury Gold Coast florist. Read our Terms & Conditions for LULLY & ROSE Floral Studio.","og_url":"https:\/\/lullyandrose.com.au\/terms-conditions\/","og_site_name":"LULLY &amp; ROSE Floral Studio","article_publisher":"https:\/\/www.facebook.com\/lullyandrose\/","article_modified_time":"2023-08-16T08:40:47+00:00","og_image":[{"width":1258,"height":501,"url":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2020\/04\/Lully-Rose-Logo-Final-RGB-Rose-Gold-Gradient.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"31 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/lullyandrose.com.au\/terms-conditions-gold-coast-florist\/","url":"https:\/\/lullyandrose.com.au\/terms-conditions\/","name":"Terms & Conditions | Gold Coast Florist - LULLY &amp; ROSE Floral Studio","isPartOf":{"@id":"https:\/\/lullyandrose.com.au\/#website"},"datePublished":"2020-04-20T18:57:58+00:00","dateModified":"2023-08-16T08:40:47+00:00","description":"LULLY & ROSE Floral Studio, a luxury Gold Coast florist. Read our Terms & Conditions for LULLY & ROSE Floral Studio.","breadcrumb":{"@id":"https:\/\/lullyandrose.com.au\/terms-conditions\/#breadcrumb"},"inLanguage":"en-AU","potentialAction":[{"@type":"ReadAction","target":["https:\/\/lullyandrose.com.au\/terms-conditions\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/lullyandrose.com.au\/terms-conditions\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/lullyandrose.com.au\/"},{"@type":"ListItem","position":2,"name":"Terms &#038; Conditions"}]},{"@type":"WebSite","@id":"https:\/\/lullyandrose.com.au\/#website","url":"https:\/\/lullyandrose.com.au\/","name":"LULLY &amp; ROSE Floral Studio","description":"LULLY &amp; ROSE Floral Studio","publisher":{"@id":"https:\/\/lullyandrose.com.au\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/lullyandrose.com.au\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-AU"},{"@type":["Organization","Place"],"@id":"https:\/\/lullyandrose.com.au\/#organization","name":"Lully & Rose Floral Studio","url":"https:\/\/lullyandrose.com.au\/","logo":{"@id":"https:\/\/lullyandrose.com.au\/terms-conditions\/#local-main-organization-logo"},"image":{"@id":"https:\/\/lullyandrose.com.au\/terms-conditions\/#local-main-organization-logo"},"sameAs":["https:\/\/www.facebook.com\/lullyandrose\/","https:\/\/www.instagram.com\/lullyandrose\/"],"telephone":["0481 810 535"],"openingHoursSpecification":[{"@type":"OpeningHoursSpecification","dayOfWeek":["Monday","Thursday","Friday","Saturday"],"opens":"10:00","closes":"14:00"},{"@type":"OpeningHoursSpecification","dayOfWeek":["Tuesday","Wednesday","Sunday"],"opens":"00:00","closes":"00:00"}],"email":"lullyandrose@hotmail.com","areaServed":"Gold Coast","vatID":"27 658 759 727","taxID":"GST"},{"@type":"ImageObject","inLanguage":"en-AU","@id":"https:\/\/lullyandrose.com.au\/terms-conditions\/#local-main-organization-logo","url":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2020\/04\/Lully-Rose-Logo-Final-RGB-Rose-Gold-Gradient.jpg","contentUrl":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2020\/04\/Lully-Rose-Logo-Final-RGB-Rose-Gold-Gradient.jpg","width":1258,"height":501,"caption":"Lully & Rose Floral Studio"}]}},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/pages\/19"}],"collection":[{"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/comments?post=19"}],"version-history":[{"count":7,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/pages\/19\/revisions"}],"predecessor-version":[{"id":7117,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/pages\/19\/revisions\/7117"}],"wp:attachment":[{"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/media?parent=19"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}