{"id":1762,"date":"2021-07-22T08:56:54","date_gmt":"2021-07-21T22:56:54","guid":{"rendered":"https:\/\/lullyandrose.com.au\/?p=1762"},"modified":"2023-05-27T23:35:24","modified_gmt":"2023-05-27T13:35:24","slug":"online-flower-ordering","status":"publish","type":"post","link":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/","title":{"rendered":"ORDERING &#038; GIFTING ONLINE"},"content":{"rendered":"<p><img loading=\"lazy\" decoding=\"async\" class=\"aligncenter wp-image-4608\" src=\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online-350x350.jpg\" alt=\"\" width=\"490\" height=\"490\" srcset=\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online-350x350.jpg 350w, https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online-100x100.jpg 100w, https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online-600x600.jpg 600w, https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online-768x768.jpg 768w, https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online.jpg 1024w, https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online-50x50.jpg 50w\" sizes=\"(max-width: 490px) 100vw, 490px\" \/><\/p>\n<p><b>Ordering and Gifting of Flower Online with LULLY &amp; ROSE<\/b><\/p>\n<p>Ordering and gifting of flower online truly is the way of the future, and we are thrilled to be a part of that! When you send a gift online with <a href=\"https:\/\/lullyandrose.com.au\">LULLY &amp; ROSE Floral Studio<\/a>, you are bringing together a beautiful combination of nature and technology to present someone you care for with stunning luxury florals and local artisan gifts. LULLY &amp; ROSE Floral Studio is a luxury florist located in the heart of the Gold Coast specialising in seasonal, perfumed, textured florals and foliages. Our contemporary style encompasses the latest trends in big city floristry, with a minimalist approach inspired by the beauty of nature. We work with the seasons to support local growers wherever possible, and hand-select florals and foliages on the day to ensure you receive only the best in your fresh, designer arrangements.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>We’ve put together this blog to showcase some of the occasions that we can cater for, and give you some inspiration and ideas for the next time you’re ordering and gifting of flower online. LULLY &amp; ROSE Floral Studio is proud to be a part of your special occasions and bring you exquisite floral designs to surprise and delight your friends and family, from milestone birthdays to Mother’s Day, Valentine’s Day, newborn arrivals, and so many more. If it’s special to you or someone you love, we can create an arrangement to suit.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>With <a href=\"https:\/\/lullyandrose.com.au\/same-day-flower-delivery\/\" target=\"_blank\" rel=\"noopener\">same day delivery<\/a> available for orders placed before 11am throughout the Gold Coast, Hinterland and Northern NSW areas, you can rest assured your luxury floral gift will arrive safe and sound on the day of your choice. We only use our specialty floral couriers, Avidity Deliveries, who deliver your arrangements as fresh and dewy as they were when they left our studio. They understand how much passion we put into creating your floral designs, and ensure that they are delivered with just as much love and care.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p><b>Milestone Birthdays<span class=\"Apple-converted-space\"> <\/span><\/b><\/p>\n<p>Celebrating a milestone birthday is such a joyous occasion for the family and friends of the guest of honour. Milestone birthdays such as twenty-firsts, thirtieths, fiftieths and sixtieths often come along with a party or special dinner, and they are a date you’re going to want to mark with something suitably memorable. Ordering and gifting of flower online is an ideal choice for birthdays, as if you won’t be seeing them on the actual day you can utilise same day delivery to ensure they feel extra special until you can celebrate alongside them.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>Finding it hard to choose the right arrangement? A favourite here at LULLY &amp; ROSE Floral Studio to create for milestone birthdays are our signature <a href=\"https:\/\/lullyandrose.com.au\/shop\/flowers\/designer-vase-floral-arrangements\/\">Designer Vase Arrangements<\/a>. They offer so much creative freedom for us to design something that is just as unique as the person receiving the arrangement. Presented in a contemporary glass vase accented with our rose gold ribbon, these arrangements are ready to put on display straight away with no fuss needed. Designer Vase Arrangements encompass our contemporary, luxury design and are a clustered style arrangement full of seasonal, perfumed, textured florals and foliages. Each individual arrangement is individually designed and styled by us, showcasing the best seasonal florals available to us on the day. Choose from five different size options for this arrangement: Petite, Standard, Generous, Lush and Lux, ranging in price. At any size, the Designer Vase Arrangement is sure to leave an impression. Some of our favourite florals to work with in this style are Reflexed and Garden Roses, Tulips, and locally grown Dahlias. If your special someone has a favourite colour, style or floral, be sure to let us know and our talented florists will do their very best to source exactly what you’re looking for depending on the season availability. <span class=\"Apple-converted-space\"> <\/span><\/p>\n<p><b>Graduations<span class=\"Apple-converted-space\"> <\/span><\/b><\/p>\n<p>Graduating from high school or university is a huge moment which shouldn’t go unacknowledged. With the number of guests per student often capped, you might not be able to attend the ceremony, so ordering and gifting of flower online is the ideal way to celebrate the recent graduate in your life. They’re sure to appreciate your thoughtful gift after all their hard work, and with same day delivery available, you can surprise them as soon as you find out the great news or choose to send your arrangement the day before their ceremony so they know you’re thinking of them on their big day.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>We think the <a href=\"https:\/\/lullyandrose.com.au\/shop\/flowers\/send-flowers-love-hugs\/\">Send Love &amp; Hugs<\/a> posy is a beautiful option for a graduation gift. This mini posy is full of seasonal, perfumed, textured florals and foliages and accompanied by a twin pack of artisanal <a href=\"https:\/\/locolove.com\">Loco Love<\/a> Chocolates from Byron Bay. With four delectable flavours to choose from, these are a sweet addition to your gift. The hardest choice of all might be whether to go with Black Cherry and Raspberry, Butter Caramel Pecan, Wild Rose Ganache, Hazelnut Praline or Salted Caramel Crunch. For an extra special gift, add a hand-poured, locally-sourced <a href=\"https:\/\/mylesgray.com.au\">Myles Gray<\/a> crystal candle so the new graduate can relax and enjoy their achievement.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p><b>Wedding Anniversaries<\/b><\/p>\n<p>Whether it’s the first, twenty-first or forty-first, florals will always be a winning choice for an anniversary gift to melt their heart all over again. Ordering and gifting of flower online also means you can surprise them when they’re least expecting it &#8211; everyone feels spoiled when a flower delivery arrives at their workplace! Send a Designer Bouquet on its own, or go the extra mile with a luxury Gift Hamper. All of our hampers are presented in our signature gift box and adorned with a rose gold ribbon for an elegant finish they’re sure to love.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>Choose from our carefully curated range of gift add-ons to suit the style of your partner: we have Tasmanian Sparkling Wine or French Champagne, beautiful Byron Bay chocolates from Loco Love and soulfully created Myles Gray Candles and Diffusers. Our personal choice would have to be including a gorgeous bottle of bubbly for you to enjoy together at the end of the day. We adore being a part of your special moments, so be sure to get in touch with us for a designer arrangement that’s just as gorgeous as they are.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p><b>Mother’s Day<span class=\"Apple-converted-space\"> <\/span><\/b><\/p>\n<p>There’s a saying we love, and you’re welcome to steal it for your Mother’s Day gift card when you’re ordering and gifting online &#8211; “<i>Life doesn<\/i>’<i>t come with a manual, it comes with a Mother.” <\/i>Treat the Mums and Mother figures in your life next Mother’s Day with an extra touch of luxury. Our range of fresh, seasonal florals is just as diverse as all the Mothers we have created arrangements for, so you’re sure to find something she loves. From the market style <a href=\"https:\/\/lullyandrose.com.au\/shop\/flowers\/fresh-florals-for-home-flowers\/\">Fresh Florals for Home<\/a> for a more organic look to our contemporary <a href=\"https:\/\/lullyandrose.com.au\/shop\/flowers\/order-flowers-enmasse\/\">En Masse<\/a> bouquets for maximum impact, we can help you select something that makes Mum’s day.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>With Mother’s Day being during our mild Australian Autumn, we love working with autumnal florals to create a seasonal arrangement that reflects the beauty of nature and your unique relationship. Hydrangeas are one of our favourite autumn florals to work with, and Zinnias are another gorgeous option. For foliages, Autumn gives us beautiful green Jasmine Foliage and rich Autumn toned Maple Foliage. We can’t wait to create something special for you next May in our contemporary style. <span class=\"Apple-converted-space\"> <\/span><\/p>\n<p><b>Valentine’s Day<span class=\"Apple-converted-space\"> <\/span><\/b><\/p>\n<p>Fresh florals on Valentine’s Day will never go out of fashion, especially when you’re ordering and gifting online from LULLY &amp; ROSE Floral Studio. Our style is a nod to the latest trends in floristry emerging from Europe, with our own unique touch inspired by the natural beauty of flowers. We love Roses just as much as the next florist, and we’ll find you the best and freshest available on the day, but if you’re feeling adventurous we would also encourage you to think bigger with your Valentine’s Day arrangement to include unique, seasonal florals and foliages that will really complement your loved one’s style. For the true romantics among us, our Signature Floral Hearts arrangements are absolute show-stoppers!<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>All LULLY &amp; ROSE florals come carefully wrapped with water or displayed in a contemporary glass vase or Norton + Norton clay vessel and accented with our signature rose gold ribbon for an extra touch of luxury on Valentine’s Day. Pair with Loco Love chocolates or Tasmanian Sparkling wine for a truly thoughtful gift they won’t forget.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p><b>Newborn Arrivals<span class=\"Apple-converted-space\"> <\/span><\/b><\/p>\n<p>Welcoming a new addition to the family is one of the most momentous occasions in life, and a gift of luxury florals is a timeless way to congratulate the growing family. Ordering and gifting online with same day delivery means that you can celebrate the new arrival without overwhelming the parents as they navigate the newborn stage. For hospital deliveries, we suggest going for the <a href=\"https:\/\/lullyandrose.com.au\/shop\/flowers\/flower-shop-floral-bowl\/\">Designer Floral Bowl<\/a> or <a href=\"https:\/\/lullyandrose.com.au\/shop\/flowers\/designer-vase-floral-arrangements\/\">Designer Vase Arrangemen<\/a>t as bouquets without vessels may not be able to be displayed as not all hospitals provide vases. In addition, these arrangements ensure that there’s no fuss of finding a vase in an already busy time and give the family something that will last long after the last petal drops. If we had to choose a favourite for newborn arrivals, it would have to be the Floral Bowl, as our hand cast ceramic ‘Cloud Bubble Vase’ designed in Australia by ‘<a href=\"https:\/\/marmosetfound.com.au\">Marmoset Found<\/a>’, are designed just for LULLY &amp; ROSE right here on the Gold Coast, so you won’t find the same one anywhere else.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p><b>Sympathy Flowers<span class=\"Apple-converted-space\"> <\/span><\/b><\/p>\n<p>When words just aren’t enough, sympathy flowers can speak volumes. We are proud to offer a tasteful range of florals that are perfect for sympathy flowers and will always work to accommodate any requests you may have. With same day delivery available, you can let your loved one know that you’re there for them in anyway they need at precisely the right time.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>Our floral range is delivered by our partnered specialty floral couriers, Avidity Deliveries, so you can rest assured that your gift will be hand delivered with the utmost care and respect. If delivering to a funeral home or funeral service, we recommend adding our contemporary glass vase to your arrangement, as bouquets without vessels may not be able to be displayed as not all funeral homes provide vases.<span class=\"Apple-converted-space\">  <\/span>LULLY &amp; ROSE is here for you in your time of need, to help you express your love and condolences the way only flowers can.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>Ordering and gifting online has never been easier than with the luxury range from <a href=\"https:\/\/lullyandrose.com.au\">LULLY &amp; ROSE Floral Studio<\/a>.<span class=\"Apple-converted-space\"> <\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ordering and Gifting of Flower Online with LULLY &amp; ROSE Ordering and gifting of flower online truly is the way of the future, and we are thrilled to be a part of that! When you send a gift online with LULLY &amp; ROSE Floral Studio, you are bringing together a beautiful combination of nature and&#8230;<\/p>\n","protected":false},"author":72,"featured_media":4608,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-1762","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-florist-insights-gold-coast"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v23.1 (Yoast SEO v23.4) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>ORDERING &amp; GIFTING ONLINE - LULLY &amp; ROSE Floral Studio<\/title>\n<meta name=\"description\" content=\"Online flower ordering has never been easier than with the luxury range from LULLY &amp; ROSE Floral Studio. Same day delivery is available.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"ORDERING &amp; GIFTING ONLINE\" \/>\n<meta property=\"og:description\" content=\"Online flower ordering has never been easier than with the luxury range from LULLY &amp; ROSE Floral Studio. Same day delivery is available.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/\" \/>\n<meta property=\"og:site_name\" content=\"LULLY &amp; ROSE Floral Studio\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/lullyandrose\/\" \/>\n<meta property=\"article:published_time\" content=\"2021-07-21T22:56:54+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-05-27T13:35:24+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"1024\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Rachael Falzon\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Rachael Falzon\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/\"},\"author\":{\"name\":\"Rachael Falzon\",\"@id\":\"https:\/\/lullyandrose.com.au\/#\/schema\/person\/b84dcf2f34207e9dd78458c0695a3cc2\"},\"headline\":\"ORDERING &#038; GIFTING ONLINE\",\"datePublished\":\"2021-07-21T22:56:54+00:00\",\"dateModified\":\"2023-05-27T13:35:24+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/\"},\"wordCount\":1799,\"publisher\":{\"@id\":\"https:\/\/lullyandrose.com.au\/#organization\"},\"image\":{\"@id\":\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online.jpg\",\"articleSection\":[\"Florist Insights\"],\"inLanguage\":\"en-AU\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/\",\"url\":\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/\",\"name\":\"ORDERING & GIFTING ONLINE - LULLY &amp; ROSE Floral Studio\",\"isPartOf\":{\"@id\":\"https:\/\/lullyandrose.com.au\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online.jpg\",\"datePublished\":\"2021-07-21T22:56:54+00:00\",\"dateModified\":\"2023-05-27T13:35:24+00:00\",\"description\":\"Online flower ordering has never been easier than with the luxury range from LULLY & ROSE Floral Studio. Same day delivery is available.\",\"breadcrumb\":{\"@id\":\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#breadcrumb\"},\"inLanguage\":\"en-AU\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-AU\",\"@id\":\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#primaryimage\",\"url\":\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online.jpg\",\"contentUrl\":\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online.jpg\",\"width\":1024,\"height\":1024,\"caption\":\"ordering-and-gifting-online\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/lullyandrose.com.au\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"ORDERING &#038; GIFTING ONLINE\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/lullyandrose.com.au\/#website\",\"url\":\"https:\/\/lullyandrose.com.au\/\",\"name\":\"LULLY &amp; ROSE Floral Studio\",\"description\":\"LULLY &amp; ROSE Floral Studio\",\"publisher\":{\"@id\":\"https:\/\/lullyandrose.com.au\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/lullyandrose.com.au\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-AU\"},{\"@type\":[\"Organization\",\"Place\"],\"@id\":\"https:\/\/lullyandrose.com.au\/#organization\",\"name\":\"Lully & Rose Floral Studio\",\"url\":\"https:\/\/lullyandrose.com.au\/\",\"logo\":{\"@id\":\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#local-main-organization-logo\"},\"image\":{\"@id\":\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#local-main-organization-logo\"},\"sameAs\":[\"https:\/\/www.facebook.com\/lullyandrose\/\",\"https:\/\/www.instagram.com\/lullyandrose\/\"],\"telephone\":[\"0481 810 535\"],\"openingHoursSpecification\":[{\"@type\":\"OpeningHoursSpecification\",\"dayOfWeek\":[\"Monday\",\"Thursday\",\"Friday\",\"Saturday\"],\"opens\":\"10:00\",\"closes\":\"14:00\"},{\"@type\":\"OpeningHoursSpecification\",\"dayOfWeek\":[\"Tuesday\",\"Wednesday\",\"Sunday\"],\"opens\":\"00:00\",\"closes\":\"00:00\"}],\"email\":\"lullyandrose@hotmail.com\",\"areaServed\":\"Gold Coast\",\"vatID\":\"27 658 759 727\",\"taxID\":\"GST\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/lullyandrose.com.au\/#\/schema\/person\/b84dcf2f34207e9dd78458c0695a3cc2\",\"name\":\"Rachael Falzon\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-AU\",\"@id\":\"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#local-main-organization-logo\",\"url\":\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2020\/04\/Lully-Rose-Logo-Final-RGB-Rose-Gold-Gradient.jpg\",\"contentUrl\":\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2020\/04\/Lully-Rose-Logo-Final-RGB-Rose-Gold-Gradient.jpg\",\"width\":1258,\"height\":501,\"caption\":\"Lully & Rose Floral Studio\"}]}<\/script>\n<meta name=\"geo.placename\" content=\"Gold Coast\" \/>\n<meta name=\"geo.region\" content=\"Australia\" \/>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"ORDERING & GIFTING ONLINE - LULLY &amp; ROSE Floral Studio","description":"Online flower ordering has never been easier than with the luxury range from LULLY & ROSE Floral Studio. Same day delivery is available.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/","og_locale":"en_US","og_type":"article","og_title":"ORDERING & GIFTING ONLINE","og_description":"Online flower ordering has never been easier than with the luxury range from LULLY & ROSE Floral Studio. Same day delivery is available.","og_url":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/","og_site_name":"LULLY &amp; ROSE Floral Studio","article_publisher":"https:\/\/www.facebook.com\/lullyandrose\/","article_published_time":"2021-07-21T22:56:54+00:00","article_modified_time":"2023-05-27T13:35:24+00:00","og_image":[{"width":1024,"height":1024,"url":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online.jpg","type":"image\/jpeg"}],"author":"Rachael Falzon","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Rachael Falzon","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#article","isPartOf":{"@id":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/"},"author":{"name":"Rachael Falzon","@id":"https:\/\/lullyandrose.com.au\/#\/schema\/person\/b84dcf2f34207e9dd78458c0695a3cc2"},"headline":"ORDERING &#038; GIFTING ONLINE","datePublished":"2021-07-21T22:56:54+00:00","dateModified":"2023-05-27T13:35:24+00:00","mainEntityOfPage":{"@id":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/"},"wordCount":1799,"publisher":{"@id":"https:\/\/lullyandrose.com.au\/#organization"},"image":{"@id":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#primaryimage"},"thumbnailUrl":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online.jpg","articleSection":["Florist Insights"],"inLanguage":"en-AU"},{"@type":"WebPage","@id":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/","url":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/","name":"ORDERING & GIFTING ONLINE - LULLY &amp; ROSE Floral Studio","isPartOf":{"@id":"https:\/\/lullyandrose.com.au\/#website"},"primaryImageOfPage":{"@id":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#primaryimage"},"image":{"@id":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#primaryimage"},"thumbnailUrl":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online.jpg","datePublished":"2021-07-21T22:56:54+00:00","dateModified":"2023-05-27T13:35:24+00:00","description":"Online flower ordering has never been easier than with the luxury range from LULLY & ROSE Floral Studio. Same day delivery is available.","breadcrumb":{"@id":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#breadcrumb"},"inLanguage":"en-AU","potentialAction":[{"@type":"ReadAction","target":["https:\/\/lullyandrose.com.au\/online-flower-ordering\/"]}]},{"@type":"ImageObject","inLanguage":"en-AU","@id":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#primaryimage","url":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online.jpg","contentUrl":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online.jpg","width":1024,"height":1024,"caption":"ordering-and-gifting-online"},{"@type":"BreadcrumbList","@id":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/lullyandrose.com.au\/"},{"@type":"ListItem","position":2,"name":"ORDERING &#038; GIFTING ONLINE"}]},{"@type":"WebSite","@id":"https:\/\/lullyandrose.com.au\/#website","url":"https:\/\/lullyandrose.com.au\/","name":"LULLY &amp; ROSE Floral Studio","description":"LULLY &amp; ROSE Floral Studio","publisher":{"@id":"https:\/\/lullyandrose.com.au\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/lullyandrose.com.au\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-AU"},{"@type":["Organization","Place"],"@id":"https:\/\/lullyandrose.com.au\/#organization","name":"Lully & Rose Floral Studio","url":"https:\/\/lullyandrose.com.au\/","logo":{"@id":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#local-main-organization-logo"},"image":{"@id":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#local-main-organization-logo"},"sameAs":["https:\/\/www.facebook.com\/lullyandrose\/","https:\/\/www.instagram.com\/lullyandrose\/"],"telephone":["0481 810 535"],"openingHoursSpecification":[{"@type":"OpeningHoursSpecification","dayOfWeek":["Monday","Thursday","Friday","Saturday"],"opens":"10:00","closes":"14:00"},{"@type":"OpeningHoursSpecification","dayOfWeek":["Tuesday","Wednesday","Sunday"],"opens":"00:00","closes":"00:00"}],"email":"lullyandrose@hotmail.com","areaServed":"Gold Coast","vatID":"27 658 759 727","taxID":"GST"},{"@type":"Person","@id":"https:\/\/lullyandrose.com.au\/#\/schema\/person\/b84dcf2f34207e9dd78458c0695a3cc2","name":"Rachael Falzon"},{"@type":"ImageObject","inLanguage":"en-AU","@id":"https:\/\/lullyandrose.com.au\/online-flower-ordering\/#local-main-organization-logo","url":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2020\/04\/Lully-Rose-Logo-Final-RGB-Rose-Gold-Gradient.jpg","contentUrl":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2020\/04\/Lully-Rose-Logo-Final-RGB-Rose-Gold-Gradient.jpg","width":1258,"height":501,"caption":"Lully & Rose Floral Studio"}]}},"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2021\/07\/Ordering-Flowers-and-Gifting-Online.jpg","_links":{"self":[{"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/posts\/1762"}],"collection":[{"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/users\/72"}],"replies":[{"embeddable":true,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/comments?post=1762"}],"version-history":[{"count":5,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/posts\/1762\/revisions"}],"predecessor-version":[{"id":6029,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/posts\/1762\/revisions\/6029"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/media\/4608"}],"wp:attachment":[{"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/media?parent=1762"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/categories?post=1762"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/tags?post=1762"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}