{"id":3722,"date":"2022-09-09T12:54:29","date_gmt":"2022-09-09T02:54:29","guid":{"rendered":"https:\/\/lullyandrose.com.au\/?p=3722"},"modified":"2024-03-12T09:25:24","modified_gmt":"2024-03-11T23:25:24","slug":"get-well-soon-flowers-gold-coast","status":"publish","type":"post","link":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/","title":{"rendered":"Get Well Soon Flowers | Flowers Are The Perfect Gift"},"content":{"rendered":"<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-medium wp-image-7216 aligncenter\" src=\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast-350x350.jpeg\" alt=\"Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast\" width=\"350\" height=\"350\" srcset=\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast-350x350.jpeg 350w, https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast-100x100.jpeg 100w, https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast-600x600.jpeg 600w, https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast-768x768.jpeg 768w, https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast-50x50.jpeg 50w, https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast.jpeg 1024w\" sizes=\"(max-width: 350px) 100vw, 350px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\">Unfortunately, we can’t always be with our loved ones when we want to be and this is especially difficult when something is happening in their lives that we want to support them through. Whether you can hand deliver them yourself or not, get well soon flowers are the perfect gift to let them know you’re thinking of them and to say you love them with more than just words. In our experience, florals always say what words cannot express.<\/p>\n<p>&nbsp;<\/p>\n<h2 style=\"text-align: center;\">Get Well Soon Flowers<\/h2>\n<p>&nbsp;<\/p>\n<p>When you order your get well soon flowers from <a href=\"https:\/\/lullyandrose.com.au\">Gold Coast Florist<\/a> LULLY &amp; ROSE Floral Studio, you can rest assured that your loved one will receive a luxury arrangement created with love and attention to detail, and delivered with the same care and compassion. No matter what they’re going through, get well soon flowers are sure to brighten their day and make them feel loved and appreciated.<\/p>\n<h5>Floral Therapy<\/h5>\n<p>Did you know that flowers have been proven to encourage recovery and lift spirits? Studies have shown that flowers have a positive short and long-term effect on mood and research participants reported feeling less depressed, anxious and agitated after receiving flowers, and even demonstrated an elevated sense of enjoyment and satisfaction with life. There are so many occasions that are appropriate to send flowers on, so don’t hesitate to show your support, sympathy and encouragement with a luxury arrangement of fresh, seasonal florals from Gold Coast florist LULLY &amp; ROSE Floral Studio &#8211; they might just help even more than you know.<\/p>\n<h5>The Science Behind Flowers Boosting Well-being<\/h5>\n<p>According to behavioural research conducted at Rutgers &#8211; The State University of New Jersey, flowers have a measurable effect on human emotions. “What’s most exciting about this study is that it challenges established scientific beliefs about how people can manage their day-to-day moods in a healthy and natural way,” said Jeannette Haviland-Jones, Ph.D., Professor of Psychology at Rutgers and lead researcher on the study.<\/p>\n<p>The study showed that women who received flowers always displayed a true smile, and still reported a heightened positive mood three days after the event and that in both men and women, flowers promoted more positive social interaction than other stimuli. In participants over the age of 55, flowers had an immediate impact on mood as well as an improvement in episodic memory. With this in mind, you know that your get well soon flowers will be doing more than just looking lovely, and will actually have a measurable positive impact on your loved ones! We love that the science is proving what we intuitively know about the power of nature.<\/p>\n<p>We’re not surprised that flowers have a positive effect on mood, after all, we love them so much we made a career out of them. As a Gold Coast florist, it’s a pleasure to be a part of bringing joy to people through the natural world in the form of seasonal, perfumed florals and foliages.<\/p>\n<p>&nbsp;<\/p>\n<h2 style=\"text-align: center;\">Top Tips For Sending Get Well Soon Flowers<\/h2>\n<p>&nbsp;<\/p>\n<h5>Choose Something That Has Its Own Vessel<\/h5>\n<p>Some hospitals may not allow loose bouquets of flowers to be delivered as there may be nowhere safe and convenient to put them, so it’s best to opt for something that already has a vase. We have you covered with our Designer Floral Bowl, a seasonal florals arrangement, arranged in a hand cast ceramic ‘Cloud Bubble Vase’ designed in Australia by ‘<a href=\"https:\/\/marmosetfound.com.au\" target=\"_blank\" rel=\"external noopener noreferrer\" data-wpel-link=\"external\">Marmoset Found<\/a>‘. Potted Phalaenopsis Orchids are another wonderful choice and will certainly give your loved one’s room a touch of elegance while brightening the space with natural colours. Our premium tall stemmed potted Phalaenopsis Orchids are arranged in a contemporary white ceramic vase adorned with a rose gold ribbon and presented in our signature gift box accented with white tissue.<\/p>\n<p>Even if you’re sending get well soon flowers to the person’s home, choosing an arrangement from a local florist, which is already in a vase removes an element of fussing on the part of the recipient so they can enjoy their gorgeous florals straight away rather than needing to find a vase or re-arrange their gift if they don’t fit into what they have at home. Plus, they’ll also have the gift of a beautiful new vase that they can enjoy using for years to come.<\/p>\n<h5>Consider Hospital Settings<\/h5>\n<p>When sending get well soon flowers to a hospital or nursing home, it&#8217;s advisable to inquire about any regulations they may have concerning floral deliveries, particularly in areas like intensive care or specialised neonatal units. Ensure you gather all the necessary details, such as the room number, for a seamless delivery experience. With our same day delivery option for orders placed before 11 am, you can act promptly, ensuring your heartfelt message is received promptly. Our specialised floral couriers handle deliveries to the Gold Coast and surrounding areas, ensuring your arrangement arrives fresh and dewy, imbued with the same love, compassion, and care with which it was created.<\/p>\n<h5>Choosing a Fragrance for a Shared Space<\/h5>\n<p>If you&#8217;re aware that your loved one is sharing a hospital room or nursing home space, it&#8217;s important to choose florals without a strong fragrance. While we appreciate the delightful scents of various flowers, it&#8217;s crucial to recognize that not everyone shares the same sentiment. To show consideration for other patients in the vicinity, opt for florals with a more subtle fragrance, avoiding flowers such as Lilies, Freesias, or Hyacinths. Instead, consider options like Roses, Carnations, or Dahlias, which still add beauty without overwhelming scents. These thoughtful choices ensure a pleasant environment for everyone in shared spaces.<\/p>\n<h5>Consider Potential Allergies of Other Patients<\/h5>\n<p>Medical environments might have limited natural airflow, posing challenges for patients, particularly those with allergies. This becomes especially problematic if a roommate receives flowers with abundant pollen that has nowhere to disperse. Opting for allergy-friendly choices like Roses, Carnations, or Chrysanthemums is a beautiful solution, as these flowers contain their pollen within the blossom. These allergy-conscious options are also accessible at LULLY &amp; ROSE.<\/p>\n<h5>Thank Your Medical Team with a Floral Arrangement<\/h5>\n<p>Nurses and doctors dedicate themselves tirelessly, and amidst the emotional challenges of dealing with illness or other circumstances, their efforts are sometimes underappreciated. Consider expressing gratitude by sending a thoughtful arrangement to the ward team where you or your loved one received care. Acknowledge their compassion and support with a gesture that we are certain will bring them joy, and we&#8217;d be delighted to assist in coordinating this for you. Beyond hospitals, floral arrangements also make wonderful gifts for nursing home staff and even veterinarians.<\/p>\n<h5>Add Extra Gifts For A Special Touch<\/h5>\n<p>When the occasion calls for it, you can add something extra to your flower delivery from our range of local artisan gifts for an added touch of luxury and care. At LULLY &amp; ROSE, supporting local businesses is paramount to us, which is why we have curated this beautiful selection of locally made gifts. We have something to delight everyone, and knowing your gift supports local businesses is just the icing on the cake—or, in this case, the delicious filling inside a Loco Love Chocolates Twin Pack. Crafted by artisan chocolate makers just over the hills in Byron Bay and packed with organic ingredients and powerful adaptogens. The only difficult decision is which flavour to choose: the decadent Wild Rose Ganache, sweet Butter Caramel Pecan, or the classic and crunchy Hazelnut Praline.<\/p>\n<p>For those who appreciate home fragrance, our Romy Louise range of candles, locally made here on the Gold Coast, will enchant them. These candles are a particularly special gift, inspired by the picturesque, mountain top city of Toowoomba and Roma in Queensland: choose from Posy, Bloom or our favourite Heritage. Supporting local businesses never tasted or smelled so good!<\/p>\n<p>Welcoming someone home? Celebrate their return with a beautiful bottle of designer Georg Jensen Sparkling White Wine or, for an extra luxe glass of bubbles, choose our French Champagne gifting option. You can add your extras to any of our bouquets or gift them with one of our luxury Gift Hampers.<\/p>\n<p style=\"text-align: left;\">Click on the links below to explore our gift collections perfect for that extra touch:<\/p>\n<p style=\"text-align: left;\">Georg Jensen Sparkling Wine<\/p>\n<p style=\"text-align: left;\">Romy Louise Candles<\/p>\n<p style=\"text-align: left;\">Loco Love Twin Chocolates<\/p>\n<p style=\"text-align: left;\">Loco Love &#8216;Lovers Box&#8217; Chocolates<\/p>\n<h2 style=\"text-align: center;\">The LULLY &amp; ROSE Difference<\/h2>\n<p>&nbsp;<\/p>\n<p>Show your care by sending get well soon flowers to your loved ones through LULLY &amp; ROSE, adding a touch of luxury with our on trend minimalist designs. Our skilled floral designer is eager to create something unique for you, expressing your sentiments through fresh, seasonal florals. We have carefully considered every additional detail, from our crisp white wrapping to the sleek ribbons, so you can focus on expressing your feelings.<\/p>\n<p>At LULLY &amp; ROSE, we prioritise locally sourced florals, handpicking the best and freshest flowers available each day. This ensures that you receive the highest quality while also supporting local farmers and growers. With LULLY &amp; ROSE, your gesture of care is not only heartfelt but also a celebration of local craftsmanship and nature&#8217;s beauty.<\/p>\n<p>&nbsp;<\/p>\n<h2 style=\"text-align: center;\">Sending Get Well Soon Flowers with LULLY &amp; ROSE<\/h2>\n<p>&nbsp;<\/p>\n<p style=\"text-align: center;\">Brightening someone&#8217;s day in challenging times goes beyond a mere gesture when you send a flower delivery to a Gold Coast hospital. Flowers offer more than visual appeal; they bring beauty, positivity, and a sense of love and support. As we navigate this process together, let&#8217;s continue uplifting spirits and infusing life into hospital rooms, reminding patients that we cherish them and surround them with the warmth of well-wishes.<\/p>\n<p style=\"text-align: center;\">Experience the joy of sending get well soon flowers to a Gold Coast hospital with <a href=\"https:\/\/lullyandrose.com.au\/\">LULLY &amp; ROSE<\/a>. Conveniently order our exquisite floral bouquets online, and enjoy same-day delivery across the <a href=\"https:\/\/www.google.com\/maps\/place\/Gold+Coast+QLD\/\">Gold Coast<\/a>.<\/p>\n<p style=\"text-align: center;\">At LULLY &amp; ROSE, we proudly extend our flower delivery services to three prominent hospitals on the Gold Coast: Gold Coast University Hospital, Gold Coast Private Hospital, and Pindara Private Hospital. Whether you&#8217;re adding a touch of warmth to a patient&#8217;s room or expressing well wishes for a speedy recovery, we carefully design our blooms with love to bring comfort and joy to the recipients.<\/p>\n<p style=\"text-align: center;\">Click on the links below to explore our collections tailored for each hospital:<\/p>\n<p style=\"text-align: center;\">Gold Coast University Hospital<\/p>\n<p style=\"text-align: center;\">Gold Coast Private Hospital<\/p>\n<p style=\"text-align: center;\">Pindara Private Hospital<\/p>\n<header class=\"page-width page-width--narrow\">\n<p style=\"text-align: center;\">Additionally, explore our blog for valuable insights and our guide for sending florals to a Gold Coast hospital, to help you show your loved ones that you care with ease and confidence of purchasing flowers online. Let&#8217;s make sure your special someone knows just how much you care.<\/p>\n<p style=\"text-align: center;\"><a class=\"button primary is-primary is-medium\"  >\n\t\t<span>Shop Here<\/span>\n\t<\/a>\n\n<\/header>\n<p style=\"text-align: center;\">\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Unfortunately, we can’t always be with our loved ones when we want to be and this is especially difficult when something is happening in their lives that we want to support them through. Whether you can hand deliver them yourself or not, get well soon flowers are the perfect gift to let them know&#8230;<\/p>\n","protected":false},"author":138,"featured_media":7216,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[1],"tags":[],"class_list":["post-3722","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-florist-insights-gold-coast"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v23.1 (Yoast SEO v23.4) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Get Well Soon Flowers | Gold Coast Florist - LULLY &amp; ROSE Floral Studio<\/title>\n<meta name=\"description\" content=\"Get well soon flowers are sure to brighten their day and make them feel loved and appreciated. Order online today for same day delivery.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Get Well Soon Flowers | Flowers Are The Perfect Gift\" \/>\n<meta property=\"og:description\" content=\"Get well soon flowers are sure to brighten their day and make them feel loved and appreciated. Order online today for same day delivery.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/\" \/>\n<meta property=\"og:site_name\" content=\"LULLY &amp; ROSE Floral Studio\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/lullyandrose\/\" \/>\n<meta property=\"article:published_time\" content=\"2022-09-09T02:54:29+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-03-11T23:25:24+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast.jpeg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"1024\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Lully Rose\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Lully Rose\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/\"},\"author\":{\"name\":\"Lully Rose\",\"@id\":\"https:\/\/lullyandrose.com.au\/#\/schema\/person\/cb8d3614909859e49a6d20bea19b817d\"},\"headline\":\"Get Well Soon Flowers | Flowers Are The Perfect Gift\",\"datePublished\":\"2022-09-09T02:54:29+00:00\",\"dateModified\":\"2024-03-11T23:25:24+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/\"},\"wordCount\":1806,\"publisher\":{\"@id\":\"https:\/\/lullyandrose.com.au\/#organization\"},\"image\":{\"@id\":\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast.jpeg\",\"articleSection\":[\"Florist Insights\"],\"inLanguage\":\"en-AU\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/\",\"url\":\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/\",\"name\":\"Get Well Soon Flowers | Gold Coast Florist - LULLY &amp; ROSE Floral Studio\",\"isPartOf\":{\"@id\":\"https:\/\/lullyandrose.com.au\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast.jpeg\",\"datePublished\":\"2022-09-09T02:54:29+00:00\",\"dateModified\":\"2024-03-11T23:25:24+00:00\",\"description\":\"Get well soon flowers are sure to brighten their day and make them feel loved and appreciated. Order online today for same day delivery.\",\"breadcrumb\":{\"@id\":\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#breadcrumb\"},\"inLanguage\":\"en-AU\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-AU\",\"@id\":\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#primaryimage\",\"url\":\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast.jpeg\",\"contentUrl\":\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast.jpeg\",\"width\":1024,\"height\":1024,\"caption\":\"Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/lullyandrose.com.au\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Get Well Soon Flowers | Flowers Are The Perfect Gift\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/lullyandrose.com.au\/#website\",\"url\":\"https:\/\/lullyandrose.com.au\/\",\"name\":\"LULLY &amp; ROSE Floral Studio\",\"description\":\"LULLY &amp; ROSE Floral Studio\",\"publisher\":{\"@id\":\"https:\/\/lullyandrose.com.au\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/lullyandrose.com.au\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-AU\"},{\"@type\":[\"Organization\",\"Place\"],\"@id\":\"https:\/\/lullyandrose.com.au\/#organization\",\"name\":\"Lully & Rose Floral Studio\",\"url\":\"https:\/\/lullyandrose.com.au\/\",\"logo\":{\"@id\":\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#local-main-organization-logo\"},\"image\":{\"@id\":\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#local-main-organization-logo\"},\"sameAs\":[\"https:\/\/www.facebook.com\/lullyandrose\/\",\"https:\/\/www.instagram.com\/lullyandrose\/\"],\"telephone\":[\"0481 810 535\"],\"openingHoursSpecification\":[{\"@type\":\"OpeningHoursSpecification\",\"dayOfWeek\":[\"Monday\",\"Thursday\",\"Friday\",\"Saturday\"],\"opens\":\"10:00\",\"closes\":\"14:00\"},{\"@type\":\"OpeningHoursSpecification\",\"dayOfWeek\":[\"Tuesday\",\"Wednesday\",\"Sunday\"],\"opens\":\"00:00\",\"closes\":\"00:00\"}],\"email\":\"lullyandrose@hotmail.com\",\"areaServed\":\"Gold Coast\",\"vatID\":\"27 658 759 727\",\"taxID\":\"GST\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/lullyandrose.com.au\/#\/schema\/person\/cb8d3614909859e49a6d20bea19b817d\",\"name\":\"Lully Rose\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-AU\",\"@id\":\"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#local-main-organization-logo\",\"url\":\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2020\/04\/Lully-Rose-Logo-Final-RGB-Rose-Gold-Gradient.jpg\",\"contentUrl\":\"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2020\/04\/Lully-Rose-Logo-Final-RGB-Rose-Gold-Gradient.jpg\",\"width\":1258,\"height\":501,\"caption\":\"Lully & Rose Floral Studio\"}]}<\/script>\n<meta name=\"geo.placename\" content=\"Gold Coast\" \/>\n<meta name=\"geo.region\" content=\"Australia\" \/>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Get Well Soon Flowers | Gold Coast Florist - LULLY &amp; ROSE Floral Studio","description":"Get well soon flowers are sure to brighten their day and make them feel loved and appreciated. Order online today for same day delivery.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/","og_locale":"en_US","og_type":"article","og_title":"Get Well Soon Flowers | Flowers Are The Perfect Gift","og_description":"Get well soon flowers are sure to brighten their day and make them feel loved and appreciated. Order online today for same day delivery.","og_url":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/","og_site_name":"LULLY &amp; ROSE Floral Studio","article_publisher":"https:\/\/www.facebook.com\/lullyandrose\/","article_published_time":"2022-09-09T02:54:29+00:00","article_modified_time":"2024-03-11T23:25:24+00:00","og_image":[{"width":1024,"height":1024,"url":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast.jpeg","type":"image\/jpeg"}],"author":"Lully Rose","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Lully Rose","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#article","isPartOf":{"@id":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/"},"author":{"name":"Lully Rose","@id":"https:\/\/lullyandrose.com.au\/#\/schema\/person\/cb8d3614909859e49a6d20bea19b817d"},"headline":"Get Well Soon Flowers | Flowers Are The Perfect Gift","datePublished":"2022-09-09T02:54:29+00:00","dateModified":"2024-03-11T23:25:24+00:00","mainEntityOfPage":{"@id":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/"},"wordCount":1806,"publisher":{"@id":"https:\/\/lullyandrose.com.au\/#organization"},"image":{"@id":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#primaryimage"},"thumbnailUrl":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast.jpeg","articleSection":["Florist Insights"],"inLanguage":"en-AU"},{"@type":"WebPage","@id":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/","url":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/","name":"Get Well Soon Flowers | Gold Coast Florist - LULLY &amp; ROSE Floral Studio","isPartOf":{"@id":"https:\/\/lullyandrose.com.au\/#website"},"primaryImageOfPage":{"@id":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#primaryimage"},"image":{"@id":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#primaryimage"},"thumbnailUrl":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast.jpeg","datePublished":"2022-09-09T02:54:29+00:00","dateModified":"2024-03-11T23:25:24+00:00","description":"Get well soon flowers are sure to brighten their day and make them feel loved and appreciated. Order online today for same day delivery.","breadcrumb":{"@id":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#breadcrumb"},"inLanguage":"en-AU","potentialAction":[{"@type":"ReadAction","target":["https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/"]}]},{"@type":"ImageObject","inLanguage":"en-AU","@id":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#primaryimage","url":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast.jpeg","contentUrl":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast.jpeg","width":1024,"height":1024,"caption":"Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast"},{"@type":"BreadcrumbList","@id":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/lullyandrose.com.au\/"},{"@type":"ListItem","position":2,"name":"Get Well Soon Flowers | Flowers Are The Perfect Gift"}]},{"@type":"WebSite","@id":"https:\/\/lullyandrose.com.au\/#website","url":"https:\/\/lullyandrose.com.au\/","name":"LULLY &amp; ROSE Floral Studio","description":"LULLY &amp; ROSE Floral Studio","publisher":{"@id":"https:\/\/lullyandrose.com.au\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/lullyandrose.com.au\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-AU"},{"@type":["Organization","Place"],"@id":"https:\/\/lullyandrose.com.au\/#organization","name":"Lully & Rose Floral Studio","url":"https:\/\/lullyandrose.com.au\/","logo":{"@id":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#local-main-organization-logo"},"image":{"@id":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#local-main-organization-logo"},"sameAs":["https:\/\/www.facebook.com\/lullyandrose\/","https:\/\/www.instagram.com\/lullyandrose\/"],"telephone":["0481 810 535"],"openingHoursSpecification":[{"@type":"OpeningHoursSpecification","dayOfWeek":["Monday","Thursday","Friday","Saturday"],"opens":"10:00","closes":"14:00"},{"@type":"OpeningHoursSpecification","dayOfWeek":["Tuesday","Wednesday","Sunday"],"opens":"00:00","closes":"00:00"}],"email":"lullyandrose@hotmail.com","areaServed":"Gold Coast","vatID":"27 658 759 727","taxID":"GST"},{"@type":"Person","@id":"https:\/\/lullyandrose.com.au\/#\/schema\/person\/cb8d3614909859e49a6d20bea19b817d","name":"Lully Rose"},{"@type":"ImageObject","inLanguage":"en-AU","@id":"https:\/\/lullyandrose.com.au\/get-well-soon-flowers-gold-coast\/#local-main-organization-logo","url":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2020\/04\/Lully-Rose-Logo-Final-RGB-Rose-Gold-Gradient.jpg","contentUrl":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2020\/04\/Lully-Rose-Logo-Final-RGB-Rose-Gold-Gradient.jpg","width":1258,"height":501,"caption":"Lully & Rose Floral Studio"}]}},"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"https:\/\/lullyandrose.com.au\/wp-content\/uploads\/2022\/09\/Get-well-soon-flowers-pretty-posy-of-perfumed-flowers-in-purple-and-lemon-tones-gold-coast.jpeg","_links":{"self":[{"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/posts\/3722"}],"collection":[{"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/users\/138"}],"replies":[{"embeddable":true,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/comments?post=3722"}],"version-history":[{"count":14,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/posts\/3722\/revisions"}],"predecessor-version":[{"id":9432,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/posts\/3722\/revisions\/9432"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/media\/7216"}],"wp:attachment":[{"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/media?parent=3722"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/categories?post=3722"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/lullyandrose.com.au\/wp-json\/wp\/v2\/tags?post=3722"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}